zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_ll_rcc.h
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   Header file of RCC LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************

  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_LL_RCC_H
#define STM32MP13xx_LL_RCC_H


#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx.h"

/** @addtogroup STM32MP13xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup RCC_LL RCC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Variables RCC Private Variables
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Constants RCC Private Constants
  * @{
  */
/* Defines used to perform offsets*/

/* Clock source register offset Vs MCO1CFGR register */
#define RCC_OFFSET_MCO1CFGR        0x000UL
#define RCC_OFFSET_MCO2CFGR        0x004UL
#define RCC_OFFSET_CKPERCKSELR     0x0ECUL
#define RCC_OFFSET_TIMG1PRER       0x140UL
#define RCC_OFFSET_TIMG2PRER       0x144UL
#define RCC_OFFSET_TIMG3PRER       0x148UL
#define RCC_OFFSET_I2C12CKSELR     0x1A0UL
#define RCC_OFFSET_I2C345CKSELR    0x1A4UL
#define RCC_OFFSET_SPI2S1CKSELR    0x1A8UL
#define RCC_OFFSET_SPI2S23CKSELR   0x1ACUL
#define RCC_OFFSET_SPI45CKSELR     0x1B0UL
#define RCC_OFFSET_UART12CKSELR    0x1B4UL
#define RCC_OFFSET_UART35CKSELR    0x1B8UL
#define RCC_OFFSET_UART4CKSELR     0x1BCUL
#define RCC_OFFSET_UART6CKSELR     0x1C0UL
#define RCC_OFFSET_UART78CKSELR    0x1C4UL
#define RCC_OFFSET_LPTIM1CKSELR    0x1C8UL
#define RCC_OFFSET_LPTIM23CKSELR   0x1CCUL
#define RCC_OFFSET_LPTIM45CKSELR   0x1D0UL
#define RCC_OFFSET_SAI1CKSELR      0x1D4UL
#define RCC_OFFSET_SAI2CKSELR      0x1D8UL
#define RCC_OFFSET_FDCANCKSELR     0x1DCUL
#define RCC_OFFSET_SPDIFCKSELR     0x1E0UL
#define RCC_OFFSET_ADC12CKSELR     0x1E4UL
#define RCC_OFFSET_SDMMC12CKSELR   0x1E8UL
#define RCC_OFFSET_ETH12CKSELR     0x1ECUL
#define RCC_OFFSET_USBCKSELR       0x1F0UL
#define RCC_OFFSET_QSPICKSELR      0x1F4UL
#define RCC_OFFSET_FMCCKSELR       0x1F8UL
#define RCC_OFFSET_RNG1CKSELR      0x1FCUL
#define RCC_OFFSET_STGENCKSELR     0x200UL
#define RCC_OFFSET_DCMIPPCKSELR    0x204UL
#define RCC_OFFSET_SAESCKSELR      0x208UL

#define RCC_CONFIG_SHIFT  0U
#define RCC_MASK_SHIFT    10U
#define RCC_REG_SHIFT     22U


/* Define all reset flags mask */
#define LL_RCC_MP_RSTSCLRR_ALL  0x000001FFU
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
#if !defined (UNUSED)
#define UNUSED(x) ((void)(x))
#endif /* !defined (UNUSED) */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Private_Macros RCC Private Macros
  * @{
  */

/* 32                  22                   10             0
   --------------------------------------------------------
   | Register          |    Mask            | ClkSource   |
   | Offset            |                    | Config      |
   --------------------------------------------------------*/

#define LL_CLKSOURCE_MASK(__CLKSOURCE__) \
  (((__CLKSOURCE__) >> RCC_MASK_SHIFT  ) & 0xFFFUL)

#define LL_CLKSOURCE_CONFIG(__CLKSOURCE__) \
  (((__CLKSOURCE__) >> RCC_CONFIG_SHIFT) & 0x3FFUL)

#define LL_CLKSOURCE_REG(__CLKSOURCE__) \
  (((__CLKSOURCE__) >> RCC_REG_SHIFT   ) & 0x3FFUL)

#define LL_CLKSOURCE(__REG__, __MSK__, __CLK__)      \
  ((uint32_t)(((__REG__) << RCC_REG_SHIFT)  | \
              (( __MSK__           ) << RCC_MASK_SHIFT) | \
              (( __CLK__           ) << RCC_CONFIG_SHIFT)))

/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Exported_Types RCC Exported Types
  * @{
  */

/** @defgroup LL_ES_CLOCK_FREQ Clocks Frequency Structure
  * @{
  */

/**
  * @brief  RCC Clocks Frequency Structure
  */
typedef struct
{
  uint32_t MPUSS_Frequency;   /*!< MPUSS clock frequency */
  uint32_t AXISS_Frequency;   /*!< AXISS clock frequency */
  uint32_t MLAHBS_Frequency;  /*!< MLAHBS clock frequency */
  uint32_t ACLK_Frequency;    /*!< ACLK clock frequency */
  uint32_t HCLK1_Frequency;   /*!< HCLK1 clock frequency */
  uint32_t HCLK2_Frequency;   /*!< HCLK2 clock frequency */
  uint32_t HCLK4_Frequency;   /*!< HCLK4 clock frequency */
  uint32_t HCLK5_Frequency;   /*!< HCLK5 clock frequency */
  uint32_t HCLK6_Frequency;   /*!< HCLK6 clock frequency */
  uint32_t MLHCLK_Frequency;  /*!< MLHCLK clock frequency */
  uint32_t PCLK1_Frequency;   /*!< PCLK1 clock frequency */
  uint32_t PCLK2_Frequency;   /*!< PCLK2 clock frequency */
  uint32_t PCLK3_Frequency;   /*!< PCLK3 clock frequency */
  uint32_t PCLK4_Frequency;   /*!< PCLK4 clock frequency */
  uint32_t PCLK5_Frequency;   /*!< PCLK5 clock frequency */
  uint32_t PCLK6_Frequency;   /*!< PCLK6 clock frequency */
} LL_RCC_ClocksTypeDef;

/**
  * @}
  */

/**
  * @brief  PLL Clocks Frequency Structure
  */
typedef struct
{
  uint32_t PLL_P_Frequency;
  uint32_t PLL_Q_Frequency;
  uint32_t PLL_R_Frequency;
} LL_PLL_ClocksTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_LL_EC_OSC_VALUES Oscillator Values adaptation
  * @brief    Defines used to adapt values of different oscillators
  * @note     These values could be modified in the user environment according to
  *           HW set-up.
  * @{
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE    24000000U   /*!< Value of the HSE oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSI_VALUE)
#define HSI_VALUE    64000000U  /*!< Value of the HSI oscillator in Hz */
#endif /* HSI_VALUE */

#if !defined  (LSE_VALUE)
#define LSE_VALUE    32768U     /*!< Value of the LSE oscillator in Hz */
#endif /* LSE_VALUE */

