zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @defgroup RCC_LL_EC_MPU_CLKSOURCE  MPU clock switch
  * @{
  */
#define LL_RCC_MPU_CLKSOURCE_HSI                0U                    /*!< HSI selection as MPU clock */
#define LL_RCC_MPU_CLKSOURCE_HSE                RCC_MPCKSELR_MPUSRC_0 /*!< HSE selection as MPU clock */
#define LL_RCC_MPU_CLKSOURCE_PLL1               RCC_MPCKSELR_MPUSRC_1 /*!< PLL1 selection as MPU clock */
#define LL_RCC_MPU_CLKSOURCE_MPUDIV             (RCC_MPCKSELR_MPUSRC_0 | RCC_MPCKSELR_MPUSRC_1) /*!< MPUDIV selection as MPU clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MPU_CLKSOURCE_STATUS  MPU clock switch status
  * @{
  */
#define LL_RCC_MPU_CLKSOURCE_STATUS_HSI         0U                    /*!< HSI used as MPU clock */
#define LL_RCC_MPU_CLKSOURCE_STATUS_HSE         RCC_MPCKSELR_MPUSRC_0 /*!< HSE used as MPU clock */
#define LL_RCC_MPU_CLKSOURCE_STATUS_PLL1        RCC_MPCKSELR_MPUSRC_1 /*!< PLL1 used as MPU clock */
#define LL_RCC_MPU_CLKSOURCE_STATUS_MPUDIV      (RCC_MPCKSELR_MPUSRC_0 | RCC_MPCKSELR_MPUSRC_1) /*!< MPUDIV used as MPU clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MPU_DIV  MPUDIV prescaler
  * @{
  */
#define LL_RCC_MPU_DIV_OFF                      0U                     /*!< MPU div is disabled, no clock generated */
#define LL_RCC_MPU_DIV_2                        RCC_MPCKDIVR_MPUDIV_0  /*!< MPUSS is equal to pll1_p_ck divided by 2 */
#define LL_RCC_MPU_DIV_4                        RCC_MPCKDIVR_MPUDIV_1  /*!< MPUSS is equal to pll1_p_ck divided by 4 */
#define LL_RCC_MPU_DIV_8                        (RCC_MPCKDIVR_MPUDIV_1 | RCC_MPCKDIVR_MPUDIV_0)  /*!< MPUSS is equal to pll1_p_ck divided by 8 */
#define LL_RCC_MPU_DIV_16                       RCC_MPCKDIVR_MPUDIV_2  /*!< MPUSS is equal to pll1_p_ck divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_AXISS_CLKSOURCE  AXISS clock switch
  * @{
  */
#define LL_RCC_AXISS_CLKSOURCE_HSI              0U                      /*!< HSI selection as AXISS clock */
#define LL_RCC_AXISS_CLKSOURCE_HSE              RCC_ASSCKSELR_AXISSRC_0 /*!< HSE selection as AXISS clock */
#define LL_RCC_AXISS_CLKSOURCE_PLL2             RCC_ASSCKSELR_AXISSRC_1 /*!< PLL2 selection as AXISS clock */
#define LL_RCC_AXISS_CLKSOURCE_OFF              (RCC_ASSCKSELR_AXISSRC_1 | RCC_ASSCKSELR_AXISSRC_0) /*!< AXISS is gated */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_AXISS_CLKSOURCE_STATUS  AXISS clock switch status
  * @{
  */
#define LL_RCC_AXISS_CLKSOURCE_STATUS_HSI       0U                      /*!< HSI used as AXISS clock */
#define LL_RCC_AXISS_CLKSOURCE_STATUS_HSE       RCC_ASSCKSELR_AXISSRC_0 /*!< HSE used as AXISS clock */
#define LL_RCC_AXISS_CLKSOURCE_STATUS_PLL2      RCC_ASSCKSELR_AXISSRC_1 /*!< PLL2 used as AXISS clock */
#define LL_RCC_AXISS_CLKSOURCE_STATUS_OFF       (RCC_ASSCKSELR_AXISSRC_1 | RCC_ASSCKSELR_AXISSRC_0) /*!< AXISS is gated */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_AXI_DIV  AXI, AHB5 and AHB6 prescaler
  * @{
  */
#define LL_RCC_AXI_DIV_1                        0U                    /*!< AXISS not divided */
#define LL_RCC_AXI_DIV_2                        RCC_AXIDIVR_AXIDIV_0  /*!< AXISS divided by 2 */
#define LL_RCC_AXI_DIV_3                        RCC_AXIDIVR_AXIDIV_1  /*!< AXISS divided by 3 */
#define LL_RCC_AXI_DIV_4                        (RCC_AXIDIVR_AXIDIV_0 | RCC_AXIDIVR_AXIDIV_1)  /*!< AXISS divided by 4 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MLAHBS_CLKSOURCE  MLAHBS clock switch
  * @{
  */
#define LL_RCC_MLAHBS_CLKSOURCE_HSI              0U                        /*!< HSI selection as MLAHBS clock */
#define LL_RCC_MLAHBS_CLKSOURCE_HSE              RCC_MSSCKSELR_MLAHBSSRC_0 /*!< HSE selection as MLAHBS clock */
#define LL_RCC_MLAHBS_CLKSOURCE_CSI              RCC_MSSCKSELR_MLAHBSSRC_1 /*!< CSI selection as MLAHBS clock */
#define LL_RCC_MLAHBS_CLKSOURCE_PLL3             (RCC_MSSCKSELR_MLAHBSSRC_1 | RCC_MSSCKSELR_MLAHBSSRC_0) /*!< PLL3 selection as MLAHBS clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MLAHBS_CLKSOURCE_STATUS  MLAHBS clock switch status
  * @{
  */
#define LL_RCC_MLAHBS_CLKSOURCE_STATUS_HSI       0U                        /*!< HSI used as MLAHBS clock */
#define LL_RCC_MLAHBS_CLKSOURCE_STATUS_HSE       RCC_MSSCKSELR_MLAHBSSRC_0 /*!< HSE used as MLAHBS clock */
#define LL_RCC_MLAHBS_CLKSOURCE_STATUS_CSI       RCC_MSSCKSELR_MLAHBSSRC_1 /*!< CSI used as MLAHBS clock */
#define LL_RCC_MLAHBS_CLKSOURCE_STATUS_PLL3      (RCC_MSSCKSELR_MLAHBSRC_1 | RCC_MSSCKSELR_MLAHBSRC_0) /*!< PLL3 used as MLAHB clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MLAHB_DIV  MLAHBDIV prescaler
  * @{
  */
#define LL_RCC_MLAHB_DIV_1                        0U                   /*!< MLAHBSS not divided */
#define LL_RCC_MLAHB_DIV_2                        RCC_MLAHBDIVR_MLAHBDIV_0 /*!< MLAHBSS divided by 2 */
#define LL_RCC_MLAHB_DIV_4                        RCC_MLAHBDIVR_MLAHBDIV_1 /*!< MLAHBSS divided by 4 */
#define LL_RCC_MLAHB_DIV_8                        (RCC_MLAHBDIVR_MLAHBDIV_1 | RCC_MLAHBDIVR_MLAHBDIV_0) /*!< MLAHBSS divided by 8 */
#define LL_RCC_MLAHB_DIV_16                       RCC_MLAHBDIVR_MLAHBDIV_2                          /*!< MLAHBSS divided by 16 */
#define LL_RCC_MLAHB_DIV_32                       (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_0) /*!< MLAHBSS divided by 32 */
#define LL_RCC_MLAHB_DIV_64                       (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_1) /*!< MLAHBSS divided by 64 */
#define LL_RCC_MLAHB_DIV_128                      (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_1 | RCC_MLAHBDIVR_MLAHBDIV_0) /*!< MLAHBSS divided by 128 */
#define LL_RCC_MLAHB_DIV_256                      RCC_MLAHBDIVR_MLAHBDIV_3                                                 /*!< MLAHBSS divided by 256 */
#define LL_RCC_MLAHB_DIV_512                      (RCC_MLAHBDIVR_MLAHBDIV_3 | RCC_MLAHBDIVR_MLAHBDIV_0)                        /*!< MLAHBSS divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB1_DIV  APB1 prescaler
  * @{
  */
#define LL_RCC_APB1_DIV_1                       0U                      /*!< mlhclk not divided (default after reset) */
#define LL_RCC_APB1_DIV_2                       RCC_APB1DIVR_APB1DIV_0  /*!< mlhclk divided by 2 */
#define LL_RCC_APB1_DIV_4                       RCC_APB1DIVR_APB1DIV_1  /*!< mlhclk divided by 4 */
#define LL_RCC_APB1_DIV_8                       (RCC_APB1DIVR_APB1DIV_1 | RCC_APB1DIVR_APB1DIV_0)  /*!< mlhclk divided by 8 */
#define LL_RCC_APB1_DIV_16                      RCC_APB1DIVR_APB1DIV_2                             /*!< mlhclk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB2_DIV  APB2 prescaler
  * @{
  */
#define LL_RCC_APB2_DIV_1                       0U                      /*!< mlhclk not divided (default after reset) */
#define LL_RCC_APB2_DIV_2                       RCC_APB2DIVR_APB2DIV_0  /*!< mlhclk divided by 2 */
#define LL_RCC_APB2_DIV_4                       RCC_APB2DIVR_APB2DIV_1  /*!< mlhclk divided by 4 */
#define LL_RCC_APB2_DIV_8                       (RCC_APB2DIVR_APB2DIV_1 | RCC_APB2DIVR_APB2DIV_0)  /*!< mlhclk divided by 8 */
#define LL_RCC_APB2_DIV_16                      RCC_APB2DIVR_APB2DIV_2                             /*!< mlhclk divided by 16 */
/**
  * @}
  */

