zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @defgroup RCC_LL_EC_APB3_DIV  APB3 prescaler
  * @{
  */
#define LL_RCC_APB3_DIV_1                       0U                      /*!< mlhclk not divided (default after reset) */
#define LL_RCC_APB3_DIV_2                       RCC_APB3DIVR_APB3DIV_0  /*!< mlhclk divided by 2 */
#define LL_RCC_APB3_DIV_4                       RCC_APB3DIVR_APB3DIV_1  /*!< mlhclk divided by 4 */
#define LL_RCC_APB3_DIV_8                       (RCC_APB3DIVR_APB3DIV_1| RCC_APB3DIVR_APB3DIV_0)  /*!< mlhclk divided by 8 */
#define LL_RCC_APB3_DIV_16                      RCC_APB3DIVR_APB3DIV_2                            /*!< mlhclk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB4_DIV  APB4 prescaler
  * @{
  */
#define LL_RCC_APB4_DIV_1                       0U                      /*!< aclk not divided (default after reset) */
#define LL_RCC_APB4_DIV_2                       RCC_APB4DIVR_APB4DIV_0  /*!< aclk divided by 2 */
#define LL_RCC_APB4_DIV_4                       RCC_APB4DIVR_APB4DIV_1  /*!< aclk divided by 4 */
#define LL_RCC_APB4_DIV_8                       (RCC_APB4DIVR_APB4DIV_1 | RCC_APB4DIVR_APB4DIV_0)  /*!< aclk divided by 8 */
#define LL_RCC_APB4_DIV_16                      RCC_APB4DIVR_APB4DIV_2                             /*!< aclk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB5_DIV  APB5 prescaler
  * @{
  */
#define LL_RCC_APB5_DIV_1                       0U                      /*!< aclk not divided (default after reset) */
#define LL_RCC_APB5_DIV_2                       RCC_APB5DIVR_APB5DIV_0  /*!< aclk divided by 2 */
#define LL_RCC_APB5_DIV_4                       RCC_APB5DIVR_APB5DIV_1  /*!< aclk divided by 4 */
#define LL_RCC_APB5_DIV_8                       (RCC_APB5DIVR_APB5DIV_1 | RCC_APB5DIVR_APB5DIV_0)  /*!< aclk divided by 8 */
#define LL_RCC_APB5_DIV_16                      RCC_APB5DIVR_APB5DIV_2                             /*!< aclk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_APB6_DIV  APB6 prescaler
  * @{
  */
#define LL_RCC_APB6_DIV_1                       0U                                                 /*!< mlhclk not divided (default after reset) */
#define LL_RCC_APB6_DIV_2                       RCC_APB6DIVR_APB6DIV_0                             /*!< mlhclk divided by 2 */
#define LL_RCC_APB6_DIV_4                       RCC_APB6DIVR_APB6DIV_1                             /*!< mlhclk divided by 4 */
#define LL_RCC_APB6_DIV_8                       (RCC_APB6DIVR_APB6DIV_1 | RCC_APB6DIVR_APB6DIV_0)  /*!< mlhclk divided by 8 */
#define LL_RCC_APB6_DIV_16                      RCC_APB6DIVR_APB6DIV_2                             /*!< mlhclk divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_MLAHB_Clock_Divider RCC_MLAHB_Clock_Divider
  * @{
  */
#define LL_RCC_MLAHB_DIV1                   0U
#define LL_RCC_MLAHB_DIV2                   RCC_MLAHBDIVR_MLAHBDIV_0
#define LL_RCC_MLAHB_DIV4                   RCC_MLAHBDIVR_MLAHBDIV_1
#define LL_RCC_MLAHB_DIV8                   (RCC_MLAHBDIVR_MLAHBDIV_1 | RCC_MLAHBDIVR_MLAHBDIV_0)
#define LL_RCC_MLAHB_DIV16                  RCC_MLAHBDIVR_MLAHBDIV_2
#define LL_RCC_MLAHB_DIV32                  (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_0)
#define LL_RCC_MLAHB_DIV64                  (RCC_MLAHBDIVR_MLAHBDIV_2 | RCC_MLAHBDIVR_MLAHBDIV_1)
#define LL_RCC_MLAHB_DIV128                 (RCC_MLAHBDIVR_MLAHBDIV_2 |\
                                             RCC_MLAHBDIVR_MLAHBDIV_1 | RCC_MLAHBDIVR_MLAHBDIV_0)
#define LL_RCC_MLAHB_DIV256                 RCC_MLAHBDIVR_MLAHBDIV_3
#define LL_RCC_MLAHB_DIV512                 (RCC_MLAHBDIVR_MLAHBDIV_3 | RCC_MLAHBDIVR_MLAHBDIV_0)

#define IS_LL_RCC_MLAHBDIV(DIVIDER) (((DIVIDER) == LL_RCC_MLAHB_DIV1)  || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV2)   || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV4)   || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV8)   || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV16)  || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV32)  || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV64)  || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV128) || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV256) || \
                                     ((DIVIDER) == LL_RCC_MLAHB_DIV512))
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSEDRIVE  LSE oscillator drive capability
  * @{
  */
#define LL_RCC_LSEDRIVE_LOW                     0U                /*!< Xtal mode lower driving capability */
#define LL_RCC_LSEDRIVE_MEDIUMLOW               RCC_BDCR_LSEDRV_0 /*!< Xtal mode medium low driving capability */
#define LL_RCC_LSEDRIVE_MEDIUMHIGH              RCC_BDCR_LSEDRV_1 /*!< Xtal mode medium high driving capability */
#define LL_RCC_LSEDRIVE_HIGH                    (RCC_BDCR_LSEDRV_1 | RCC_BDCR_LSEDRV_0) /*!< Xtal mode higher driving capability */
/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO              0x00000000U /*!< No clock enabled for the peripheral */
#define LL_RCC_PERIPH_FREQUENCY_NA              0xFFFFFFFFU /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */


/** @defgroup RCC_LL_EC_I2Cx_CLKSOURCE  Peripheral I2C clock source selection
  * @{
  */
#define LL_RCC_I2C12_CLKSOURCE_PCLK1        LL_CLKSOURCE(RCC_OFFSET_I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, 0U)
#define LL_RCC_I2C12_CLKSOURCE_PLL4R        LL_CLKSOURCE(RCC_OFFSET_I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, \
                                                         RCC_I2C12CKSELR_I2C12SRC_0)
#define LL_RCC_I2C12_CLKSOURCE_HSI          LL_CLKSOURCE(RCC_OFFSET_I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, \
                                                         RCC_I2C12CKSELR_I2C12SRC_1)
#define LL_RCC_I2C12_CLKSOURCE_CSI          LL_CLKSOURCE(RCC_OFFSET_I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, \
                                                         (RCC_I2C12CKSELR_I2C12SRC_1 | RCC_I2C12CKSELR_I2C12SRC_0))

#define LL_RCC_I2C3_CLKSOURCE_PCLK6         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC, 0U)
#define LL_RCC_I2C3_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC, \
                                                         RCC_I2C345CKSELR_I2C3SRC_0)
#define LL_RCC_I2C3_CLKSOURCE_HSI           LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC, \
                                                         RCC_I2C345CKSELR_I2C3SRC_1)
#define LL_RCC_I2C3_CLKSOURCE_CSI           LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC, \
                                                         (RCC_I2C345CKSELR_I2C3SRC_1 | RCC_I2C345CKSELR_I2C3SRC_0))

#define LL_RCC_I2C4_CLKSOURCE_PCLK6         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC, 0U)
#define LL_RCC_I2C4_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC, \
                                                         RCC_I2C345CKSELR_I2C4SRC_0)
#define LL_RCC_I2C4_CLKSOURCE_HSI           LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC, \
                                                         RCC_I2C345CKSELR_I2C4SRC_1)
#define LL_RCC_I2C4_CLKSOURCE_CSI           LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC, \
                                                         (RCC_I2C345CKSELR_I2C4SRC_1 | RCC_I2C345CKSELR_I2C4SRC_0))

