zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
#define LL_RCC_I2C5_CLKSOURCE_PCLK6         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C5SRC, 0U)
#define LL_RCC_I2C5_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C5SRC, \
                                                         RCC_I2C345CKSELR_I2C5SRC_0)
#define LL_RCC_I2C5_CLKSOURCE_HSI           LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C5SRC, \
                                                         RCC_I2C345CKSELR_I2C5SRC_1)
#define LL_RCC_I2C5_CLKSOURCE_CSI           LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C5SRC, \
                                                         (RCC_I2C345CKSELR_I2C5SRC_1 | RCC_I2C345CKSELR_I2C5SRC_0))
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SPIx_CLKSOURCE  Peripheral SPI/I2S clock source selection
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE_PLL4P         LL_CLKSOURCE(RCC_OFFSET_SPI2S1CKSELR, RCC_SPI2S1CKSELR_SPI1SRC, 0U)
#define LL_RCC_SPI1_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_SPI2S1CKSELR, RCC_SPI2S1CKSELR_SPI1SRC, \
                                                         RCC_SPI2S1CKSELR_SPI1SRC_0)
#define LL_RCC_SPI1_CLKSOURCE_I2SCKIN       LL_CLKSOURCE(RCC_OFFSET_SPI2S1CKSELR, RCC_SPI2S1CKSELR_SPI1SRC, \
                                                         RCC_SPI2S1CKSELR_SPI1SRC_1)
#define LL_RCC_SPI1_CLKSOURCE_PER           LL_CLKSOURCE(RCC_OFFSET_SPI2S1CKSELR, RCC_SPI2S1CKSELR_SPI1SRC, \
                                                         (RCC_SPI2S1CKSELR_SPI1SRC_1 | RCC_SPI2S1CKSELR_SPI1SRC_0))
#define LL_RCC_SPI1_CLKSOURCE_PLL3R         LL_CLKSOURCE(RCC_OFFSET_SPI2S1CKSELR, RCC_SPI2S1CKSELR_SPI1SRC, \
                                                         RCC_SPI2S1CKSELR_SPI1SRC_2)

#define LL_RCC_SPI23_CLKSOURCE_PLL4P        LL_CLKSOURCE(RCC_OFFSET_SPI2S23CKSELR, RCC_SPI2S23CKSELR_SPI23SRC, 0U)
#define LL_RCC_SPI23_CLKSOURCE_PLL3Q        LL_CLKSOURCE(RCC_OFFSET_SPI2S23CKSELR, RCC_SPI2S23CKSELR_SPI23SRC, \
                                                         RCC_SPI2S23CKSELR_SPI23SRC_0)
#define LL_RCC_SPI23_CLKSOURCE_I2SCKIN      LL_CLKSOURCE(RCC_OFFSET_SPI2S23CKSELR, RCC_SPI2S23CKSELR_SPI23SRC, \
                                                         RCC_SPI2S23CKSELR_SPI23SRC_1)
#define LL_RCC_SPI23_CLKSOURCE_PER          LL_CLKSOURCE(RCC_OFFSET_SPI2S23CKSELR, RCC_SPI2S23CKSELR_SPI23SRC, \
                                                         (RCC_SPI2S23CKSELR_SPI23SRC_1 | RCC_SPI2S23CKSELR_SPI23SRC_0))
#define LL_RCC_SPI23_CLKSOURCE_PLL3R        LL_CLKSOURCE(RCC_OFFSET_SPI2S23CKSELR, RCC_SPI2S23CKSELR_SPI23SRC, \
                                                         RCC_SPI2S23CKSELR_SPI23SRC_2)

#define LL_RCC_SPI4_CLKSOURCE_PCLK6         LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC, 0U)
#define LL_RCC_SPI4_CLKSOURCE_PLL4Q         LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC, \
                                                         RCC_SPI45CKSELR_SPI4SRC_0)
#define LL_RCC_SPI4_CLKSOURCE_HSI           LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC, \
                                                         RCC_SPI45CKSELR_SPI4SRC_1)
#define LL_RCC_SPI4_CLKSOURCE_CSI           LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC, \
                                                         (RCC_SPI45CKSELR_SPI4SRC_1 | RCC_SPI45CKSELR_SPI4SRC_0))
#define LL_RCC_SPI4_CLKSOURCE_HSE           LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC, \
                                                         RCC_SPI45CKSELR_SPI4SRC_2)

#define LL_RCC_SPI5_CLKSOURCE_PCLK6         LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, 0U)
#define LL_RCC_SPI5_CLKSOURCE_PLL4Q         LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, \
                                                         RCC_SPI45CKSELR_SPI5SRC_0)
#define LL_RCC_SPI5_CLKSOURCE_HSI           LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, \
                                                         RCC_SPI45CKSELR_SPI5SRC_1)
#define LL_RCC_SPI5_CLKSOURCE_CSI           LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, \
                                                         (RCC_SPI45CKSELR_SPI5SRC_1 | RCC_SPI45CKSELR_SPI5SRC_0))
#define LL_RCC_SPI5_CLKSOURCE_HSE           LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, \
                                                         RCC_SPI45CKSELR_SPI5SRC_2)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USARTx_CLKSOURCE  Peripheral USART clock source selection
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE_PCLK6       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, 0U)
#define LL_RCC_USART1_CLKSOURCE_PLL3Q       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, \
                                                         RCC_UART12CKSELR_UART1SRC_0)
#define LL_RCC_USART1_CLKSOURCE_HSI         LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, \
                                                         RCC_UART12CKSELR_UART1SRC_1)
#define LL_RCC_USART1_CLKSOURCE_CSI         LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, \
                                                         (RCC_UART12CKSELR_UART1SRC_1 | RCC_UART12CKSELR_UART1SRC_0))
#define LL_RCC_USART1_CLKSOURCE_PLL4Q       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, \
                                                         RCC_UART12CKSELR_UART1SRC_2)
#define LL_RCC_USART1_CLKSOURCE_HSE         LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, \
                                                         (RCC_UART12CKSELR_UART1SRC_2 | RCC_UART12CKSELR_UART1SRC_0))

#define LL_RCC_USART2_CLKSOURCE_PCLK6       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, 0U)
#define LL_RCC_USART2_CLKSOURCE_PLL3Q       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, \
                                                         RCC_UART12CKSELR_UART2SRC_0)
#define LL_RCC_USART2_CLKSOURCE_HSI         LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, \
                                                         RCC_UART12CKSELR_UART2SRC_1)
#define LL_RCC_USART2_CLKSOURCE_CSI         LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, \
                                                         (RCC_UART12CKSELR_UART2SRC_1 | RCC_UART12CKSELR_UART2SRC_0))
#define LL_RCC_USART2_CLKSOURCE_PLL4Q       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, \
                                                         RCC_UART12CKSELR_UART2SRC_2)
#define LL_RCC_USART2_CLKSOURCE_HSE         LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, \
                                                         (RCC_UART12CKSELR_UART2SRC_2 | RCC_UART12CKSELR_UART2SRC_0))

#define LL_RCC_USART35_CLKSOURCE_PCLK1      LL_CLKSOURCE(RCC_OFFSET_UART35CKSELR, RCC_UART35CKSELR_UART35SRC, 0U)
#define LL_RCC_USART35_CLKSOURCE_PLL4Q      LL_CLKSOURCE(RCC_OFFSET_UART35CKSELR, RCC_UART35CKSELR_UART35SRC, \
                                                         RCC_UART35CKSELR_UART35SRC_0)
#define LL_RCC_USART35_CLKSOURCE_HSI        LL_CLKSOURCE(RCC_OFFSET_UART35CKSELR, RCC_UART35CKSELR_UART35SRC, \
                                                         RCC_UART35CKSELR_UART35SRC_1)
#define LL_RCC_USART35_CLKSOURCE_CSI        LL_CLKSOURCE(RCC_OFFSET_UART35CKSELR, RCC_UART35CKSELR_UART35SRC, \
                                                         (RCC_UART35CKSELR_UART35SRC_1 | RCC_UART35CKSELR_UART35SRC_0))
#define LL_RCC_USART35_CLKSOURCE_HSE        LL_CLKSOURCE(RCC_OFFSET_UART35CKSELR, RCC_UART35CKSELR_UART35SRC, \
                                                         RCC_UART35CKSELR_UART35SRC_2)

#define LL_RCC_UART4_CLKSOURCE_PCLK1        LL_CLKSOURCE(RCC_OFFSET_UART4CKSELR, RCC_UART4CKSELR_UART4SRC, 0U)
#define LL_RCC_UART4_CLKSOURCE_PLL4Q        LL_CLKSOURCE(RCC_OFFSET_UART4CKSELR, RCC_UART4CKSELR_UART4SRC, \
                                                         RCC_UART4CKSELR_UART4SRC_0)
#define LL_RCC_UART4_CLKSOURCE_HSI          LL_CLKSOURCE(RCC_OFFSET_UART4CKSELR, RCC_UART4CKSELR_UART4SRC, \
                                                         RCC_UART4CKSELR_UART4SRC_1)
#define LL_RCC_UART4_CLKSOURCE_CSI          LL_CLKSOURCE(RCC_OFFSET_UART4CKSELR, RCC_UART4CKSELR_UART4SRC, \
                                                         (RCC_UART4CKSELR_UART4SRC_1 | RCC_UART4CKSELR_UART4SRC_0))
#define LL_RCC_UART4_CLKSOURCE_HSE          LL_CLKSOURCE(RCC_OFFSET_UART4CKSELR, RCC_UART4CKSELR_UART4SRC, \
                                                         RCC_UART4CKSELR_UART4SRC_2)

#define LL_RCC_USART6_CLKSOURCE_PCLK2       LL_CLKSOURCE(RCC_OFFSET_UART6CKSELR, RCC_UART6CKSELR_UART6SRC, 0U)
#define LL_RCC_USART6_CLKSOURCE_PLL4Q       LL_CLKSOURCE(RCC_OFFSET_UART6CKSELR, RCC_UART6CKSELR_UART6SRC, \
                                                         RCC_UART6CKSELR_UART6SRC_0)
#define LL_RCC_USART6_CLKSOURCE_HSI         LL_CLKSOURCE(RCC_OFFSET_UART6CKSELR, RCC_UART6CKSELR_UART6SRC, \
                                                         RCC_UART6CKSELR_UART6SRC_1)
#define LL_RCC_USART6_CLKSOURCE_CSI         LL_CLKSOURCE(RCC_OFFSET_UART6CKSELR, RCC_UART6CKSELR_UART6SRC, \
                                                         (RCC_UART6CKSELR_UART6SRC_1 | RCC_UART6CKSELR_UART6SRC_0))
#define LL_RCC_USART6_CLKSOURCE_HSE         LL_CLKSOURCE(RCC_OFFSET_UART6CKSELR, RCC_UART6CKSELR_UART6SRC, \
                                                         RCC_UART6CKSELR_UART6SRC_2)

#define LL_RCC_UART78_CLKSOURCE_PCLK1       LL_CLKSOURCE(RCC_OFFSET_UART78CKSELR, RCC_UART78CKSELR_UART78SRC, 0U)
#define LL_RCC_UART78_CLKSOURCE_PLL4Q       LL_CLKSOURCE(RCC_OFFSET_UART78CKSELR, RCC_UART78CKSELR_UART78SRC, \
                                                         RCC_UART78CKSELR_UART78SRC_0)
#define LL_RCC_UART78_CLKSOURCE_HSI         LL_CLKSOURCE(RCC_OFFSET_UART78CKSELR, RCC_UART78CKSELR_UART78SRC, \
                                                         RCC_UART78CKSELR_UART78SRC_1)
#define LL_RCC_UART78_CLKSOURCE_CSI         LL_CLKSOURCE(RCC_OFFSET_UART78CKSELR, RCC_UART78CKSELR_UART78SRC, \
                                                         (RCC_UART78CKSELR_UART78SRC_1 | RCC_UART78CKSELR_UART78SRC_0))
#define LL_RCC_UART78_CLKSOURCE_HSE         LL_CLKSOURCE(RCC_OFFSET_UART78CKSELR, RCC_UART78CKSELR_UART78SRC, \
                                                         RCC_UART78CKSELR_UART78SRC_2)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LPTIMx_CLKSOURCE  Peripheral LPTIM clock source selection
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE_PCLK1       LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, 0U)
#define LL_RCC_LPTIM1_CLKSOURCE_PLL4P       LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, \
                                                         RCC_LPTIM1CKSELR_LPTIM1SRC_0)
#define LL_RCC_LPTIM1_CLKSOURCE_PLL3Q       LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, \
                                                         RCC_LPTIM1CKSELR_LPTIM1SRC_1)
#define LL_RCC_LPTIM1_CLKSOURCE_LSE         LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, \
                                                         (RCC_LPTIM1CKSELR_LPTIM1SRC_1 | RCC_LPTIM1CKSELR_LPTIM1SRC_0))
#define LL_RCC_LPTIM1_CLKSOURCE_LSI         LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, \
                                                         RCC_LPTIM1CKSELR_LPTIM1SRC_2)
#define LL_RCC_LPTIM1_CLKSOURCE_PER         LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, \
                                                         (RCC_LPTIM1CKSELR_LPTIM1SRC_2 | RCC_LPTIM1CKSELR_LPTIM1SRC_0))
#define LL_RCC_LPTIM1_CLKSOURCE_OFF         LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, \
                                                         (RCC_LPTIM1CKSELR_LPTIM1SRC_2 | RCC_LPTIM1CKSELR_LPTIM1SRC_1))

