zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
#define LL_RCC_LPTIM2_CLKSOURCE_PCLK3      LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, 0U)
#define LL_RCC_LPTIM2_CLKSOURCE_PLL4Q      LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, \
                                                        RCC_LPTIM23CKSELR_LPTIM2SRC_0)
#define LL_RCC_LPTIM2_CLKSOURCE_PER        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, \
                                                        RCC_LPTIM23CKSELR_LPTIM2SRC_1)
#define LL_RCC_LPTIM2_CLKSOURCE_LSE        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, \
                                                        (RCC_LPTIM23CKSELR_LPTIM2SRC_1 | RCC_LPTIM23CKSELR_LPTIM2SRC_0))
#define LL_RCC_LPTIM2_CLKSOURCE_LSI        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, \
                                                        RCC_LPTIM23CKSELR_LPTIM2SRC_2)
#define LL_RCC_LPTIM2_CLKSOURCE_OFF        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, \
                                                        (RCC_LPTIM23CKSELR_LPTIM2SRC_2 | RCC_LPTIM23CKSELR_LPTIM2SRC_0))

#define LL_RCC_LPTIM3_CLKSOURCE_PCLK3      LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, 0U)
#define LL_RCC_LPTIM3_CLKSOURCE_PLL4Q      LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, \
                                                        RCC_LPTIM23CKSELR_LPTIM3SRC_0)
#define LL_RCC_LPTIM3_CLKSOURCE_PER        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, \
                                                        RCC_LPTIM23CKSELR_LPTIM3SRC_1)
#define LL_RCC_LPTIM3_CLKSOURCE_LSE        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, \
                                                        (RCC_LPTIM23CKSELR_LPTIM3SRC_1 | RCC_LPTIM23CKSELR_LPTIM3SRC_0))
#define LL_RCC_LPTIM3_CLKSOURCE_LSI        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, \
                                                        RCC_LPTIM23CKSELR_LPTIM3SRC_2)
#define LL_RCC_LPTIM3_CLKSOURCE_OFF        LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, \
                                                        (RCC_LPTIM23CKSELR_LPTIM3SRC_2 | RCC_LPTIM23CKSELR_LPTIM3SRC_0))

#define LL_RCC_LPTIM45_CLKSOURCE_PCLK3      LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, 0U)
#define LL_RCC_LPTIM45_CLKSOURCE_PLL4P      LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, \
                                                         RCC_LPTIM45CKSELR_LPTIM45SRC_0)
#define LL_RCC_LPTIM45_CLKSOURCE_PLL3Q      LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, \
                                                         RCC_LPTIM45CKSELR_LPTIM45SRC_1)
#define LL_RCC_LPTIM45_CLKSOURCE_LSE        LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, \
                                                         (RCC_LPTIM45CKSELR_LPTIM45SRC_1 | \
                                                          RCC_LPTIM45CKSELR_LPTIM45SRC_0))
#define LL_RCC_LPTIM45_CLKSOURCE_LSI        LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, \
                                                         RCC_LPTIM45CKSELR_LPTIM45SRC_2)
#define LL_RCC_LPTIM45_CLKSOURCE_PER        LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, \
                                                         (RCC_LPTIM45CKSELR_LPTIM45SRC_2 | \
                                                          RCC_LPTIM45CKSELR_LPTIM45SRC_0))
#define LL_RCC_LPTIM45_CLKSOURCE_OFF        LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, \
                                                         (RCC_LPTIM45CKSELR_LPTIM45SRC_2 | \
                                                          RCC_LPTIM45CKSELR_LPTIM45SRC_1))
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SAIx_CLKSOURCE  Peripheral SAI clock source selection
  * @{
  */
#define LL_RCC_SAI1_CLKSOURCE_PLL4Q         LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, 0U)
#define LL_RCC_SAI1_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, \
                                                         RCC_SAI1CKSELR_SAI1SRC_0)
#define LL_RCC_SAI1_CLKSOURCE_I2SCKIN       LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, \
                                                         RCC_SAI1CKSELR_SAI1SRC_1)
#define LL_RCC_SAI1_CLKSOURCE_PER           LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, \
                                                         (RCC_SAI1CKSELR_SAI1SRC_1 | RCC_SAI1CKSELR_SAI1SRC_0))
#define LL_RCC_SAI1_CLKSOURCE_PLL3R         LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, \
                                                         RCC_SAI1CKSELR_SAI1SRC_2)

#define LL_RCC_SAI2_CLKSOURCE_PLL4Q         LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, 0U)
#define LL_RCC_SAI2_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, \
                                                         RCC_SAI2CKSELR_SAI2SRC_0)
#define LL_RCC_SAI2_CLKSOURCE_I2SCKIN       LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, \
                                                         RCC_SAI2CKSELR_SAI2SRC_1)
#define LL_RCC_SAI2_CLKSOURCE_PER           LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, \
                                                         (RCC_SAI2CKSELR_SAI2SRC_1 | RCC_SAI2CKSELR_SAI2SRC_0))
#define LL_RCC_SAI2_CLKSOURCE_SPDIF         LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, \
                                                         RCC_SAI2CKSELR_SAI2SRC_2)
#define LL_RCC_SAI2_CLKSOURCE_PLL3R         LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, \
                                                         (RCC_SAI2CKSELR_SAI2SRC_2 | RCC_SAI2CKSELR_SAI2SRC_0))

/**
  * @}
  */

#if defined(FDCAN1)
/** @defgroup RCC_LL_EC_FDCAN_CLKSOURCE  Peripheral FDCAN clock source selection
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE_HSE          LL_CLKSOURCE(RCC_OFFSET_FDCANCKSELR, RCC_FDCANCKSELR_FDCANSRC, 0U)
#define LL_RCC_FDCAN_CLKSOURCE_PLL3Q        LL_CLKSOURCE(RCC_OFFSET_FDCANCKSELR, RCC_FDCANCKSELR_FDCANSRC, \
                                                         RCC_FDCANCKSELR_FDCANSRC_0)
#define LL_RCC_FDCAN_CLKSOURCE_PLL4Q        LL_CLKSOURCE(RCC_OFFSET_FDCANCKSELR, RCC_FDCANCKSELR_FDCANSRC, \
                                                         RCC_FDCANCKSELR_FDCANSRC_1)
#define LL_RCC_FDCAN_CLKSOURCE_PLL4R        LL_CLKSOURCE(RCC_OFFSET_FDCANCKSELR, RCC_FDCANCKSELR_FDCANSRC, \
                                                         (RCC_FDCANCKSELR_FDCANSRC_1 | RCC_FDCANCKSELR_FDCANSRC_0))
/**
  * @}
  */
#endif /*FDCAN1*/

/** @defgroup RCC_LL_EC_SPDIFRX_CLKSOURCE  Peripheral SPDIFRX clock source selection
  * @{
  */
#define LL_RCC_SPDIFRX_CLKSOURCE_PLL4P      LL_CLKSOURCE(RCC_OFFSET_SPDIFCKSELR, RCC_SPDIFCKSELR_SPDIFSRC, 0U)
#define LL_RCC_SPDIFRX_CLKSOURCE_PLL3Q      LL_CLKSOURCE(RCC_OFFSET_SPDIFCKSELR, RCC_SPDIFCKSELR_SPDIFSRC, \
                                                         RCC_SPDIFCKSELR_SPDIFSRC_0)
#define LL_RCC_SPDIFRX_CLKSOURCE_HSI        LL_CLKSOURCE(RCC_OFFSET_SPDIFCKSELR, RCC_SPDIFCKSELR_SPDIFSRC, \
                                                         RCC_SPDIFCKSELR_SPDIFSRC_1)
/**
  * @}
  */

