zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @defgroup RCC_LL_EC_ADC_CLKSOURCE  Peripheral ADC clock source selection
  * @{
  */
#define LL_RCC_ADC1_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC1SRC, 0U)
#define LL_RCC_ADC1_CLKSOURCE_PER           LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC1SRC, \
                                                         RCC_ADC12CKSELR_ADC1SRC_0)
#define LL_RCC_ADC1_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC1SRC, \
                                                         RCC_ADC12CKSELR_ADC1SRC_1)
#define LL_RCC_ADC2_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC2SRC, 0U)
#define LL_RCC_ADC2_CLKSOURCE_PER           LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC2SRC, \
                                                         RCC_ADC12CKSELR_ADC2SRC_0)
#define LL_RCC_ADC2_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC2SRC, \
                                                         RCC_ADC12CKSELR_ADC2SRC_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SDMMCx_CLKSOURCE  Peripheral SDMMC clock source selection
  * @{
  */
#define LL_RCC_SDMMC1_CLKSOURCE_HCLK6       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC, 0U)
#define LL_RCC_SDMMC1_CLKSOURCE_PLL3R       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC, \
                                                         RCC_SDMMC12CKSELR_SDMMC1SRC_0)
#define LL_RCC_SDMMC1_CLKSOURCE_PLL4P       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC, \
                                                         RCC_SDMMC12CKSELR_SDMMC1SRC_1)
#define LL_RCC_SDMMC1_CLKSOURCE_HSI         LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC, \
                                                         (RCC_SDMMC12CKSELR_SDMMC1SRC_1 | \
                                                          RCC_SDMMC12CKSELR_SDMMC1SRC_0))

#define LL_RCC_SDMMC2_CLKSOURCE_HCLK6       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC, 0U)
#define LL_RCC_SDMMC2_CLKSOURCE_PLL3R       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC, \
                                                         RCC_SDMMC12CKSELR_SDMMC2SRC_0)
#define LL_RCC_SDMMC2_CLKSOURCE_PLL4P       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC, \
                                                         RCC_SDMMC12CKSELR_SDMMC2SRC_1)
#define LL_RCC_SDMMC2_CLKSOURCE_HSI         LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC, \
                                                         (RCC_SDMMC12CKSELR_SDMMC2SRC_1 | \
                                                          RCC_SDMMC12CKSELR_SDMMC2SRC_0))
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ETH_CLKSOURCE  Peripheral ETH clock source selection
  * @{
  */
#define LL_RCC_ETH1_CLKSOURCE_PLL4P         LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH1SRC, 0U)
#define LL_RCC_ETH1_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH1SRC, \
                                                         RCC_ETH12CKSELR_ETH1SRC_0)
#define LL_RCC_ETH1_CLKSOURCE_OFF           LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH1SRC, \
                                                         RCC_ETH12CKSELR_ETH1SRC_1)
#define LL_RCC_ETH2_CLKSOURCE_PLL4P         LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH2SRC, 0U)
#define LL_RCC_ETH2_CLKSOURCE_PLL3Q         LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH2SRC, \
                                                         RCC_ETH12CKSELR_ETH2SRC_0)
#define LL_RCC_ETH2_CLKSOURCE_OFF           LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH2SRC, \
                                                         RCC_ETH12CKSELR_ETH2SRC_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USBPHY_CLKSOURCE  Peripheral USBPHY clock source selection
  * @{
  */
#define LL_RCC_USBPHY_CLKSOURCE_HSE         LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBPHYSRC, 0U)
#define LL_RCC_USBPHY_CLKSOURCE_PLL4R       LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBPHYSRC, \
                                                         RCC_USBCKSELR_USBPHYSRC_0)
#define LL_RCC_USBPHY_CLKSOURCE_HSE2        LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBPHYSRC, \
                                                         RCC_USBCKSELR_USBPHYSRC_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USBO_CLKSOURCE  Peripheral USBO clock source selection
  * @{
  */
#define LL_RCC_USBO_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBOSRC, 0U)
#define LL_RCC_USBO_CLKSOURCE_PHY           LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBOSRC, \
                                                         RCC_USBCKSELR_USBOSRC)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_QSPI_CLKSOURCE  Peripheral QSPI clock source selection
  * @{
  */
#define LL_RCC_QSPI_CLKSOURCE_ACLK          LL_CLKSOURCE(RCC_OFFSET_QSPICKSELR, RCC_QSPICKSELR_QSPISRC, 0U)
#define LL_RCC_QSPI_CLKSOURCE_PLL3R         LL_CLKSOURCE(RCC_OFFSET_QSPICKSELR, RCC_QSPICKSELR_QSPISRC, \
                                                         RCC_QSPICKSELR_QSPISRC_0)
#define LL_RCC_QSPI_CLKSOURCE_PLL4P         LL_CLKSOURCE(RCC_OFFSET_QSPICKSELR, RCC_QSPICKSELR_QSPISRC, \
                                                         RCC_QSPICKSELR_QSPISRC_1)
#define LL_RCC_QSPI_CLKSOURCE_PER           LL_CLKSOURCE(RCC_OFFSET_QSPICKSELR, RCC_QSPICKSELR_QSPISRC, \
                                                         (RCC_QSPICKSELR_QSPISRC_1 | RCC_QSPICKSELR_QSPISRC_0))
/**
  * @}
  */

/** @defgroup RCC_LL_EC_FMC_CLKSOURCE  Peripheral FMC clock source selection
  * @{
  */
#define LL_RCC_FMC_CLKSOURCE_ACLK           LL_CLKSOURCE(RCC_OFFSET_FMCCKSELR, RCC_FMCCKSELR_FMCSRC, 0U)
#define LL_RCC_FMC_CLKSOURCE_PLL3R          LL_CLKSOURCE(RCC_OFFSET_FMCCKSELR, RCC_FMCCKSELR_FMCSRC,\
                                                         RCC_FMCCKSELR_FMCSRC_0)
#define LL_RCC_FMC_CLKSOURCE_PLL4P          LL_CLKSOURCE(RCC_OFFSET_FMCCKSELR, RCC_FMCCKSELR_FMCSRC, \
                                                         RCC_FMCCKSELR_FMCSRC_1)
#define LL_RCC_FMC_CLKSOURCE_PER            LL_CLKSOURCE(RCC_OFFSET_FMCCKSELR, RCC_FMCCKSELR_FMCSRC, \
                                                         (RCC_FMCCKSELR_FMCSRC_1 | RCC_FMCCKSELR_FMCSRC_0))
/**
  * @}
  */


