zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @defgroup RCC_LL_EC_RNGx_CLKSOURCE  Peripheral RNG clock source selection
  * @{
  */
#define LL_RCC_RNG1_CLKSOURCE_CSI           LL_CLKSOURCE(RCC_OFFSET_RNG1CKSELR, RCC_RNG1CKSELR_RNG1SRC, 0U)
#define LL_RCC_RNG1_CLKSOURCE_PLL4R         LL_CLKSOURCE(RCC_OFFSET_RNG1CKSELR, RCC_RNG1CKSELR_RNG1SRC, \
                                                         RCC_RNG1CKSELR_RNG1SRC_0)
#define LL_RCC_RNG1_CLKSOURCE_LSI           LL_CLKSOURCE(RCC_OFFSET_RNG1CKSELR, RCC_RNG1CKSELR_RNG1SRC, \
                                                         (RCC_RNG1CKSELR_RNG1SRC_1 | RCC_RNG1CKSELR_RNG1SRC_0))

/**
  * @}
  */

/** @defgroup RCC_LL_EC_STGEN_CLKSOURCE  Peripheral STGEN clock source selection
  * @{
  */
#define LL_RCC_STGEN_CLKSOURCE_HSI          LL_CLKSOURCE(RCC_OFFSET_STGENCKSELR, RCC_STGENCKSELR_STGENSRC, 0U)
#define LL_RCC_STGEN_CLKSOURCE_HSE          LL_CLKSOURCE(RCC_OFFSET_STGENCKSELR, RCC_STGENCKSELR_STGENSRC, \
                                                         RCC_STGENCKSELR_STGENSRC_0)
#define LL_RCC_STGEN_CLKSOURCE_OFF          LL_CLKSOURCE(RCC_OFFSET_STGENCKSELR, RCC_STGENCKSELR_STGENSRC, \
                                                         RCC_STGENCKSELR_STGENSRC_1)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_DCMIPP_CLKSOURCE  Peripheral DCMIPP clock source selection
  * @{
  */
#define LL_RCC_DCMIPP_CLKSOURCE_ACLK       LL_CLKSOURCE(RCC_OFFSET_DCMIPPCKSELR,  RCC_DCMIPPCKSELR_DCMIPPSRC, 0U)
#define LL_RCC_DCMIPP_CLKSOURCE_PLL2Q      LL_CLKSOURCE(RCC_OFFSET_DCMIPPCKSELR,  RCC_DCMIPPCKSELR_DCMIPPSRC, \
                                                        RCC_DCMIPPCKSELR_DCMIPPSRC_0)
#define LL_RCC_DCMIPP_CLKSOURCE_PLL4P      LL_CLKSOURCE(RCC_OFFSET_DCMIPPCKSELR,  RCC_DCMIPPCKSELR_DCMIPPSRC, \
                                                        RCC_DCMIPPCKSELR_DCMIPPSRC_1)
#define LL_RCC_DCMIPP_CLKSOURCE_PER        LL_CLKSOURCE(RCC_OFFSET_DCMIPPCKSELR,  RCC_DCMIPPCKSELR_DCMIPPSRC, \
                                                        (RCC_DCMIPPCKSELR_DCMIPPSRC_1 | RCC_DCMIPPCKSELR_DCMIPPSRC_0))
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SAES_CLKSOURCE  Peripheral SAES clock source selection
  * @{
  */
#define LL_RCC_SAES_CLKSOURCE_ACLK         LL_CLKSOURCE(RCC_OFFSET_SAESCKSELR,  RCC_SAESCKSELR_SAESSRC, 0U)
#define LL_RCC_SAES_CLKSOURCE_PER          LL_CLKSOURCE(RCC_OFFSET_SAESCKSELR,  RCC_SAESCKSELR_SAESSRC, \
                                                        RCC_SAESCKSELR_SAESSRC_0)
#define LL_RCC_SAES_CLKSOURCE_PLL4R        LL_CLKSOURCE(RCC_OFFSET_SAESCKSELR,  RCC_SAESCKSELR_SAESSRC, \
                                                        RCC_SAESCKSELR_SAESSRC_1)
#define LL_RCC_SAES_CLKSOURCE_LSI          LL_CLKSOURCE(RCC_OFFSET_SAESCKSELR,  RCC_SAESCKSELR_SAESSRC, \
                                                        (RCC_SAESCKSELR_SAESSRC_1 | RCC_SAESCKSELR_SAESSRC_0))
/**
  * @}
  */


/** @defgroup RCC_LL_EC_CKPER_CLKSOURCE  Peripheral CKPER clock source selection
  * @{
  */
#define LL_RCC_CKPER_CLKSOURCE_HSI          LL_CLKSOURCE(RCC_OFFSET_CKPERCKSELR, RCC_CPERCKSELR_CKPERSRC, 0U)
#define LL_RCC_CKPER_CLKSOURCE_CSI          LL_CLKSOURCE(RCC_OFFSET_CKPERCKSELR, RCC_CPERCKSELR_CKPERSRC, \
                                                         RCC_CPERCKSELR_CKPERSRC_0)
#define LL_RCC_CKPER_CLKSOURCE_HSE          LL_CLKSOURCE(RCC_OFFSET_CKPERCKSELR, RCC_CPERCKSELR_CKPERSRC, \
                                                         RCC_CPERCKSELR_CKPERSRC_1)
#define LL_RCC_CKPER_CLKSOURCE_OFF          LL_CLKSOURCE(RCC_OFFSET_CKPERCKSELR, RCC_CPERCKSELR_CKPERSRC, \
                                                         (RCC_CPERCKSELR_CKPERSRC_1 | RCC_CPERCKSELR_CKPERSRC_0))
/**
  * @}
  */


/** @defgroup RCC_LL_EC_TIMGx_Prescaler_Selection TIMG Prescaler selection
  * @{
  */
#define LL_RCC_TIMG1PRES_DEACTIVATED        LL_CLKSOURCE(RCC_OFFSET_TIMG1PRER, RCC_TIMG1PRER_TIMG1PRE, 0U)
#define LL_RCC_TIMG1PRES_ACTIVATED          LL_CLKSOURCE(RCC_OFFSET_TIMG1PRER, RCC_TIMG1PRER_TIMG1PRE, \
                                                         RCC_TIMG1PRER_TIMG1PRE)

#define LL_RCC_TIMG2PRES_DEACTIVATED        LL_CLKSOURCE(RCC_OFFSET_TIMG2PRER, RCC_TIMG2PRER_TIMG2PRE, 0U)
#define LL_RCC_TIMG2PRES_ACTIVATED          LL_CLKSOURCE(RCC_OFFSET_TIMG2PRER, RCC_TIMG2PRER_TIMG2PRE, \
                                                         RCC_TIMG2PRER_TIMG2PRE)

#define LL_RCC_TIMG3PRES_DEACTIVATED        LL_CLKSOURCE(RCC_OFFSET_TIMG3PRER, RCC_TIMG3PRER_TIMG3PRE, 0U)
#define LL_RCC_TIMG3PRES_ACTIVATED          LL_CLKSOURCE(RCC_OFFSET_TIMG3PRER, RCC_TIMG3PRER_TIMG3PRE, \
                                                         RCC_TIMG3PRER_TIMG3PRE)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RTC_CLKSOURCE  RTC clock source selection
  * @{
  */
#define LL_RCC_RTC_CLKSOURCE_NONE           0U                                       /*!< No clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSE            RCC_BDCR_RTCSRC_0                        /*!< LSE oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_LSI            RCC_BDCR_RTCSRC_1                        /*!< LSI oscillator clock used as RTC clock */
#define LL_RCC_RTC_CLKSOURCE_HSE_DIV        (RCC_BDCR_RTCSRC_1 | RCC_BDCR_RTCSRC_0)  /*!< HSE oscillator clock divided by RTCDIV used as RTC clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_I2Cx  Peripheral I2C get clock source
  * @{
  */
#define LL_RCC_I2C12_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_I2C12CKSELR, RCC_I2C12CKSELR_I2C12SRC, 0x00000000U)
#define LL_RCC_I2C3_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C3SRC, 0x00000000U)
#define LL_RCC_I2C4_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C4SRC, 0x00000000U)
#define LL_RCC_I2C5_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_I2C345CKSELR, RCC_I2C345CKSELR_I2C5SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SPIx  Peripheral SPI/I2S get clock source
  * @{
  */
#define LL_RCC_SPI1_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_SPI2S1CKSELR, RCC_SPI2S1CKSELR_SPI1SRC, 0x00000000U)
#define LL_RCC_SPI23_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_SPI2S23CKSELR, RCC_SPI2S23CKSELR_SPI23SRC, 0x00000000U)
#define LL_RCC_SPI4_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI4SRC, 0x00000000U)
#define LL_RCC_SPI5_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_SPI45CKSELR, RCC_SPI45CKSELR_SPI5SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USARTx  Peripheral USART get clock source
  * @{
  */
#define LL_RCC_USART1_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART1SRC, 0x00000000U)
#define LL_RCC_USART2_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_UART12CKSELR, RCC_UART12CKSELR_UART2SRC, 0x00000000U)
#define LL_RCC_USART35_CLKSOURCE      LL_CLKSOURCE(RCC_OFFSET_UART35CKSELR, RCC_UART35CKSELR_UART35SRC, 0x00000000U)
#define LL_RCC_UART4_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_UART4CKSELR, RCC_UART4CKSELR_UART4SRC, 0x00000000U)
#define LL_RCC_USART6_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_UART6CKSELR, RCC_UART6CKSELR_UART6SRC, 0x00000000U)
#define LL_RCC_UART78_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_UART78CKSELR, RCC_UART78CKSELR_UART78SRC, 0x00000000U)
/**
  * @}
  */

