zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @defgroup RCC_LL_EC_LPTIMx Peripheral LPTIM get clock source
  * @{
  */
#define LL_RCC_LPTIM1_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_LPTIM1CKSELR, RCC_LPTIM1CKSELR_LPTIM1SRC, 0x00000000U)
#define LL_RCC_LPTIM2_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM2SRC, 0x00000000U)
#define LL_RCC_LPTIM3_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_LPTIM23CKSELR, RCC_LPTIM23CKSELR_LPTIM3SRC, 0x00000000U)
#define LL_RCC_LPTIM45_CLKSOURCE      LL_CLKSOURCE(RCC_OFFSET_LPTIM45CKSELR, RCC_LPTIM45CKSELR_LPTIM45SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SAIx  Peripheral SAI get clock source
  * @{
  */
#define LL_RCC_SAI1_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, 0x00000000U)
#define LL_RCC_SAI2_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_SAI2CKSELR, RCC_SAI2CKSELR_SAI2SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_DFSDM  Peripheral DFSDM get clock source
  * @{
  */
/* @note DFSDM and SA1 share the same kernel clock Muxer */
#define LL_RCC_DFSDM_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_SAI1CKSELR, RCC_SAI1CKSELR_SAI1SRC, 0x00000000U)
/**
  * @}
  */

#if defined(FDCAN1)
/** @defgroup RCC_LL_EC_FDCAN  Peripheral FDCAN get clock source
  * @{
  */
#define LL_RCC_FDCAN_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_FDCANCKSELR, RCC_FDCANCKSELR_FDCANSRC, 0x00000000U)
/**
  * @}
  */
#endif /*FDCAN1*/

/** @defgroup RCC_LL_EC_SPDIFRX  Peripheral SPDIFRX get clock source
  * @{
  */
#define LL_RCC_SPDIFRX_CLKSOURCE      LL_CLKSOURCE(RCC_OFFSET_SPDIFCKSELR, RCC_SPDIFCKSELR_SPDIFSRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ADC Peripheral ADC get clock source
  * @{
  */
#define LL_RCC_ADC1_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC1SRC, 0x00000000U)
#define LL_RCC_ADC2_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_ADC12CKSELR, RCC_ADC12CKSELR_ADC2SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SDMMCx  Peripheral SDMMC get clock source
  * @{
  */
#define LL_RCC_SDMMC1_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC1SRC, 0x00000000U)
#define LL_RCC_SDMMC2_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_SDMMC12CKSELR, RCC_SDMMC12CKSELR_SDMMC2SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_ETH  Peripheral ETH get clock source
  * @{
  */
#define LL_RCC_ETH1_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH1SRC, 0x00000000U)
#define LL_RCC_ETH2_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_ETH12CKSELR, RCC_ETH12CKSELR_ETH2SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USBPHY Peripheral USBPHY get clock source
  * @{
  */
#define LL_RCC_USBPHY_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBPHYSRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_USBO  Peripheral USBO get clock source
  * @{
  */
#define LL_RCC_USBO_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_USBCKSELR, RCC_USBCKSELR_USBOSRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_QSPI  Peripheral QSPI get clock source
  * @{
  */
#define LL_RCC_QSPI_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_QSPICKSELR, RCC_QSPICKSELR_QSPISRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_FMC  Peripheral FMC get clock source
  * @{
  */
#define LL_RCC_FMC_CLKSOURCE          LL_CLKSOURCE(RCC_OFFSET_FMCCKSELR, RCC_FMCCKSELR_FMCSRC, 0x00000000U)
/**
  * @}
  */


/** @defgroup RCC_LL_EC_RNGx Peripheral RNG get clock source
  * @{
  */
#define LL_RCC_RNG1_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_RNG1CKSELR, RCC_RNG1CKSELR_RNG1SRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_STGEN Peripheral STGEN get clock source
  * @{
  */
#define LL_RCC_STGEN_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_STGENCKSELR, RCC_STGENCKSELR_STGENSRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SAES Peripheral SAES get clock source
  * @{
  */
#define LL_RCC_DCMIPP_CLKSOURCE       LL_CLKSOURCE(RCC_OFFSET_DCMIPPCKSELR,  RCC_DCMIPPCKSELR_DCMIPPSRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SAES Peripheral SAES get clock source
  * @{
  */
#define LL_RCC_SAES_CLKSOURCE         LL_CLKSOURCE(RCC_OFFSET_SAESCKSELR,  RCC_SAESCKSELR_SAESSRC, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_CKPER Peripheral CKPER get clock source
  * @{
  */
#define LL_RCC_CKPER_CLKSOURCE        LL_CLKSOURCE(RCC_OFFSET_CKPERCKSELR, RCC_CPERCKSELR_CKPERSRC, 0x00000000U)
/**
  * @}
  */


/** @defgroup RCC_LL_EC_TIMGx_Prescaler TIMG get prescaler selection
  * @{
  */
#define LL_RCC_TIMG1PRES              LL_CLKSOURCE(RCC_OFFSET_TIMG1PRER, RCC_TIMG1PRER_TIMG1PRE, 0x00000000U)
#define LL_RCC_TIMG2PRES              LL_CLKSOURCE(RCC_OFFSET_TIMG2PRER, RCC_TIMG2PRER_TIMG2PRE, 0x00000000U)
#define LL_RCC_TIMG3PRES              LL_CLKSOURCE(RCC_OFFSET_TIMG3PRER, RCC_TIMG3PRER_TIMG3PRE, 0x00000000U)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL12SOURCE  PLL1 and PLL2 entry clock source
  * @{
  */
#define LL_RCC_PLL12SOURCE_HSI        0U                        /*!< HSI clock selected as PLL12 entry clock source */
#define LL_RCC_PLL12SOURCE_HSE        RCC_RCK12SELR_PLL12SRC_0  /*!< HSE clock selected as PLL12 entry clock source */
#define LL_RCC_PLL12SOURCE_NONE       RCC_RCK12SELR_PLL12SRC_1  /*!< No clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL3SOURCE  PLL3 entry clock source
  * @{
  */
#define LL_RCC_PLL3SOURCE_HSI         0U                      /*!< HSI clock selected as PLL3 entry clock source */
#define LL_RCC_PLL3SOURCE_HSE         RCC_RCK3SELR_PLL3SRC_0  /*!< HSE clock selected as PLL3 entry clock source */
#define LL_RCC_PLL3SOURCE_CSI         RCC_RCK3SELR_PLL3SRC_1  /*!< CSI clock selected as PLL3 entry clock source */
#define LL_RCC_PLL3SOURCE_NONE        (RCC_RCK3SELR_PLL3SRC_1 | RCC_RCK3SELR_PLL3SRC_0)  /*!< No clock */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_PLL4SOURCE  PLL4 entry clock source
  * @{
  */
#define LL_RCC_PLL4SOURCE_HSI         0U                      /*!< HSI clock selected as PLL4 entry clock source */
#define LL_RCC_PLL4SOURCE_HSE         RCC_RCK4SELR_PLL4SRC_0  /*!< HSE clock selected as PLL4 entry clock source */
#define LL_RCC_PLL4SOURCE_CSI         RCC_RCK4SELR_PLL4SRC_1  /*!< CSI clock selected as PLL4 entry clock source */
#define LL_RCC_PLL4SOURCE_I2SCKIN     (RCC_RCK4SELR_PLL4SRC_1 | RCC_RCK4SELR_PLL4SRC_0)  /*!< Signal I2S_CKIN selected as PLL4 entry clock source */
/**
  * @}
  */

/** @defgroup RCC_LL_PLL3_IF_Range RCC PLL3 Input Frequency Range
  * @{
  */
#define LL_RCC_PLL3IFRANGE_0          0U                    /*!< The PLL3 input (ref3_ck) clock range frequency
                                                                 is between 4 and 8 MHz (default after reset) */
#define LL_RCC_PLL3IFRANGE_1          RCC_PLL3CFGR1_IFRGE_0 /*!< The PLL3 input (ref3_ck) clock range frequency
                                                                 is between 8 and 16 MHz */
/**
  * @}
  */

/** @defgroup RCC_LL_PLL4_IF_Range RCC PLL4 Input Frequency Range
  * @{
  */
#define LL_RCC_PLL4IFRANGE_0          0U                     /*!< The PLL4 input (ref4_ck) clock range frequency
                                                                 is between 4 and 8 MHz (default after reset) */
#define LL_RCC_PLL4IFRANGE_1          RCC_PLL4CFGR1_IFRGE_0 /*!< The PLL4 input (ref4_ck) clock range frequency
                                                                 is between 8 and 16 MHz */
/**
  * @}
  */

