zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_LSE LSE
  * @{
  */

/**
  * @brief  Enable  Low Speed External (LSE) crystal.
  * @rmtoll BDCR         LSEON         LL_RCC_LSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_Enable(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);
}

/**
  * @brief  Disable  Low Speed External (LSE) crystal.
  * @rmtoll BDCR         LSEON         LL_RCC_LSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_Disable(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);
}

/**
  * @brief  Enable external clock source (LSE bypass).
  * @rmtoll BDCR         LSEBYP        LL_RCC_LSE_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableBypass(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
}

/**
  * @brief  Disable external clock source (LSE bypass).
  * @rmtoll BDCR         LSEBYP        LL_RCC_LSE_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableBypass(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
}

/**
  * @brief  Enable external digital clock source (LSE Digital Bypass).
  * @rmtoll BDCR         DIGBYP, LSEBYP    LL_RCC_LSE_EnableDigBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableDigBypass(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_DIGBYP);
  SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);
}

/**
  * @brief  Disable external digital clock source (LSE Digital Bypass).
  * @rmtoll BDCR         DIGBYP, LSEBYP     LL_RCC_LSE_DisableDigBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableDigBypass(void)
{
  CLEAR_BIT(RCC->BDCR, (RCC_BDCR_LSEBYP | RCC_BDCR_DIGBYP));
}

/**
  * @brief  Set LSE oscillator drive capability
  * @note The oscillator is in Xtal mode when it is not in bypass mode.
  * @rmtoll BDCR         LSEDRV        LL_RCC_LSE_SetDriveCapability
  * @param  LSEDrive This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_SetDriveCapability(uint32_t LSEDrive)
{
  MODIFY_REG(RCC->BDCR, RCC_BDCR_LSEDRV, LSEDrive);
}

/**
  * @brief  Get LSE oscillator drive capability
  * @rmtoll BDCR         LSEDRV        LL_RCC_LSE_GetDriveCapability
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_GetDriveCapability(void)
{
  return (uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_LSEDRV));
}

/**
  * @brief  Enable Clock security system on LSE.
  * @rmtoll BDCR         LSECSSON      LL_RCC_LSE_EnableCSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableCSS(void)
{
  SET_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Disable Clock security system on LSE.
  * @note Clock security system can be disabled only after a LSE
  *       failure detection. In that case it MUST be disabled by software.
  * @rmtoll BDCR         LSECSSON      LL_RCC_LSE_DisableCSS
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableCSS(void)
{
  CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSECSSON);
}

/**
  * @brief  Check if LSE oscillator Ready
  * @rmtoll BDCR         LSERDY        LL_RCC_LSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsReady(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSERDY) == RCC_BDCR_LSERDY) ? 1UL : 0UL);
}

/**
  * @brief  Check if CSS on LSE failure Detection
  * @rmtoll BDCR         LSECSSD       LL_RCC_LSE_IsCSSDetected
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsCSSDetected(void)
{
  return ((READ_BIT(RCC->BDCR, RCC_BDCR_LSECSSD) == RCC_BDCR_LSECSSD) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_LSI LSI
  * @{
  */

/**
  * @brief  Enable LSI Oscillator
  * @rmtoll RDLSICR          LSION         LL_RCC_LSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Enable(void)
{
  SET_BIT(RCC->RDLSICR, RCC_RDLSICR_LSION);
}

/**
  * @brief  Disable LSI Oscillator
  * @rmtoll RDLSICR          LSION         LL_RCC_LSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Disable(void)
{
  CLEAR_BIT(RCC->RDLSICR, RCC_RDLSICR_LSION);
}

/**
  * @brief  Check if LSI is Ready
  * @rmtoll RDLSICR          LSIRDY        LL_RCC_LSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsReady(void)
{
  return ((READ_BIT(RCC->RDLSICR, RCC_RDLSICR_LSIRDY) == RCC_RDLSICR_LSIRDY) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_System System
  * @{
  */

/**
  * @brief  Configure the mpu clock source
  * @rmtoll MPCKSELR         MPUSRC            LL_RCC_SetMPUClkSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_PLL1
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_MPUDIV
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMPUClkSource(uint32_t Source)
{
  MODIFY_REG(RCC->MPCKSELR, RCC_MPCKSELR_MPUSRC, Source);
}

/**
  * @brief  Configure the axiss clock source
  * @rmtoll ASSCKSELR         AXISSRC            LL_RCC_SetAXISSClkSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_PLL2
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_OFF
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAXISSClkSource(uint32_t Source)
{
  MODIFY_REG(RCC->ASSCKSELR, RCC_ASSCKSELR_AXISSRC, Source);
}

/**
  * @brief  Configure the mlahbs clock source
  * @rmtoll MSSCKSELR         MLAHBSRC            LL_RCC_SetMLAHBClkSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_PLL3
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMLAHBSClkSource(uint32_t Source)
{
  MODIFY_REG(RCC->MSSCKSELR, (RCC_MSSCKSELR_MLAHBSSRC), Source);
}

/**
  * @brief  Set the MPUDIV prescaler
  * @rmtoll MPCKDIVR         MPUDIV            LL_RCC_SetMPUPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MPU_DIV_OFF
  *         @arg @ref LL_RCC_MPU_DIV_2
  *         @arg @ref LL_RCC_MPU_DIV_4
  *         @arg @ref LL_RCC_MPU_DIV_8
  *         @arg @ref LL_RCC_MPU_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMPUPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->MPCKDIVR, RCC_MPCKDIVR_MPUDIV, Prescaler);
}

/**
  * @brief  Set the ACLK (ACLK, HCLK5 and HCLK6) prescaler
  * @rmtoll AXIDIVR         ACLK            LL_RCC_SetACLKPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_AXI_DIV_1
  *         @arg @ref LL_RCC_AXI_DIV_2
  *         @arg @ref LL_RCC_AXI_DIV_3
  *         @arg @ref LL_RCC_AXI_DIV_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetACLKPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->AXIDIVR, RCC_AXIDIVR_AXIDIV, Prescaler);
}

/**
  * @brief  Set the MLHCLK (MLHCLK, MLAHB, FCLK, HCLK4, HCLK2 and HCLK1) prescaler
  * @rmtoll MLAHBDIVR         MLAHBDIV            LL_RCC_SetMLHCLKPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MLAHB_DIV_1
  *         @arg @ref LL_RCC_MLAHB_DIV_2
  *         @arg @ref LL_RCC_MLAHB_DIV_4
  *         @arg @ref LL_RCC_MLAHB_DIV_8
  *         @arg @ref LL_RCC_MLAHB_DIV_16
  *         @arg @ref LL_RCC_MLAHB_DIV_32
  *         @arg @ref LL_RCC_MLAHB_DIV_64
  *         @arg @ref LL_RCC_MLAHB_DIV_128
  *         @arg @ref LL_RCC_MLAHB_DIV_256
  *         @arg @ref LL_RCC_MLAHB_DIV_512

