zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetMLHCLKPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->MLAHBDIVR, RCC_MLAHBDIVR_MLAHBDIV, Prescaler);
}

/**
  * @brief  Set the APB1 prescaler
  * @rmtoll APB1DIVR         APB1            LL_RCC_SetAPB1Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB1_DIV_1
  *         @arg @ref LL_RCC_APB1_DIV_2
  *         @arg @ref LL_RCC_APB1_DIV_4
  *         @arg @ref LL_RCC_APB1_DIV_8
  *         @arg @ref LL_RCC_APB1_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB1Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->APB1DIVR, RCC_APB1DIVR_APB1DIV, Prescaler);
}

/**
  * @brief  Set the APB2 prescaler
  * @rmtoll APB2DIVR         APB2            LL_RCC_SetAPB2Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB2_DIV_1
  *         @arg @ref LL_RCC_APB2_DIV_2
  *         @arg @ref LL_RCC_APB2_DIV_4
  *         @arg @ref LL_RCC_APB2_DIV_8
  *         @arg @ref LL_RCC_APB2_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB2Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->APB2DIVR, RCC_APB2DIVR_APB2DIV, Prescaler);
}

/**
  * @brief  Set the APB3 prescaler
  * @rmtoll APB3DIVR         APB3            LL_RCC_SetAPB3Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB3_DIV_1
  *         @arg @ref LL_RCC_APB3_DIV_2
  *         @arg @ref LL_RCC_APB3_DIV_4
  *         @arg @ref LL_RCC_APB3_DIV_8
  *         @arg @ref LL_RCC_APB3_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB3Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->APB3DIVR, RCC_APB3DIVR_APB3DIV, Prescaler);
}

/**
  * @brief  Set the APB4 prescaler
  * @rmtoll APB4DIVR         APB4            LL_RCC_SetAPB4Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB4_DIV_1
  *         @arg @ref LL_RCC_APB4_DIV_2
  *         @arg @ref LL_RCC_APB4_DIV_4
  *         @arg @ref LL_RCC_APB4_DIV_8
  *         @arg @ref LL_RCC_APB4_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB4Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->APB4DIVR, RCC_APB4DIVR_APB4DIV, Prescaler);
}

/**
  * @brief  Set the APB5 prescaler
  * @rmtoll APB5DIVR         APB5            LL_RCC_SetAPB5Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB5_DIV_1
  *         @arg @ref LL_RCC_APB5_DIV_2
  *         @arg @ref LL_RCC_APB5_DIV_4
  *         @arg @ref LL_RCC_APB5_DIV_8
  *         @arg @ref LL_RCC_APB5_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB5Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->APB5DIVR, RCC_APB5DIVR_APB5DIV, Prescaler);
}

/**
  * @brief  Set the APB6 prescaler
  * @rmtoll APB6DIVR         APB6            LL_RCC_SetAPB6Prescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_APB6_DIV_1
  *         @arg @ref LL_RCC_APB6_DIV_2
  *         @arg @ref LL_RCC_APB6_DIV_4
  *         @arg @ref LL_RCC_APB6_DIV_8
  *         @arg @ref LL_RCC_APB6_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetAPB6Prescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->APB6DIVR, RCC_APB6DIVR_APB6DIV, Prescaler);
}

/**
  * @brief  Get the mpu clock source
  * @rmtoll MPCKSELR         MPUSRC           LL_RCC_GetMPUClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_PLL1
  *         @arg @ref LL_RCC_MPU_CLKSOURCE_MPUDIV
  */
__STATIC_INLINE uint32_t LL_RCC_GetMPUClkSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MPCKSELR, RCC_MPCKSELR_MPUSRC));
}

/**
  * @brief  Get the axiss clock source
  * @rmtoll ASSCKSELR         AXISSRC           LL_RCC_GetAXISSClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_PLL2
  *         @arg @ref LL_RCC_AXISS_CLKSOURCE_OFF
  */
__STATIC_INLINE uint32_t LL_RCC_GetAXISSClkSource(void)
{
  return (uint32_t)(READ_BIT(RCC->ASSCKSELR, RCC_ASSCKSELR_AXISSRC));
}

/**
  * @brief  Get the mcuss clock source
  * @rmtoll MSSCKSELR         MLAHBSRC           LL_RCC_GetMLAHBClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_MLAHBS_CLKSOURCE_PLL3
  */
__STATIC_INLINE uint32_t LL_RCC_GetMLAHBSClkSource(void)
{
  return (uint32_t)(READ_BIT(RCC->MSSCKSELR, RCC_MSSCKSELR_MLAHBSSRC));
}

/**
  * @brief  Get the MPUDIV prescaler
  * @rmtoll MPCKDIVR         MPUDIV           LL_RCC_GetMPUPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MPU_DIV_OFF
  *         @arg @ref LL_RCC_MPU_DIV_2
  *         @arg @ref LL_RCC_MPU_DIV_4
  *         @arg @ref LL_RCC_MPU_DIV_8
  *         @arg @ref LL_RCC_MPU_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetMPUPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->MPCKDIVR, RCC_MPCKDIVR_MPUDIV));
}

/**
  * @brief  Get the ACLK (ACLK, HCLK5 and HCLK6) prescaler
  * @rmtoll AXIDIVR         ACLK           LL_RCC_GetACLKPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_AXI_DIV_1
  *         @arg @ref LL_RCC_AXI_DIV_2
  *         @arg @ref LL_RCC_AXI_DIV_3
  *         @arg @ref LL_RCC_AXI_DIV_4
  */
__STATIC_INLINE uint32_t LL_RCC_GetACLKPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->AXIDIVR, RCC_AXIDIVR_AXIDIV));
}

/** @brief  Get the MLHCLK (MLHCLK, MLAHB, FCLK, HCLK4, HCLK2 and HCLK1) prescaler
  * @rmtoll MLAHBDIVR         MLAHBDIV           LL_RCC_GetMLHCLKPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MLAHB_DIV_1
  *         @arg @ref LL_RCC_MLAHB_DIV_2
  *         @arg @ref LL_RCC_MLAHB_DIV_4
  *         @arg @ref LL_RCC_MLAHB_DIV_8
  *         @arg @ref LL_RCC_MLAHB_DIV_16
  *         @arg @ref LL_RCC_MLAHB_DIV_32
  *         @arg @ref LL_RCC_MLAHB_DIV_64
  *         @arg @ref LL_RCC_MLAHB_DIV_128
  *         @arg @ref LL_RCC_MLAHB_DIV_256
  *         @arg @ref LL_RCC_MLAHB_DIV_512
  */
__STATIC_INLINE uint32_t LL_RCC_GetMLHCLKPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->MLAHBDIVR, RCC_MLAHBDIVR_MLAHBDIV));
}

/**
  * @brief  Get the APB1 prescaler
  * @rmtoll APB1DIVR         APB1           LL_RCC_GetAPB1Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB1_DIV_1
  *         @arg @ref LL_RCC_APB1_DIV_2
  *         @arg @ref LL_RCC_APB1_DIV_4
  *         @arg @ref LL_RCC_APB1_DIV_8
  *         @arg @ref LL_RCC_APB1_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB1Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB1DIVR, RCC_APB1DIVR_APB1DIV));
}

/**
  * @brief  Get the APB2 prescaler
  * @rmtoll APB2DIVR         APB2           LL_RCC_GetAPB2Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB2_DIV_1
  *         @arg @ref LL_RCC_APB2_DIV_2
  *         @arg @ref LL_RCC_APB2_DIV_4
  *         @arg @ref LL_RCC_APB2_DIV_8
  *         @arg @ref LL_RCC_APB2_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB2Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB2DIVR, RCC_APB2DIVR_APB2DIV));
}

/**
  * @brief  Get the APB3 prescaler
  * @rmtoll APB3DIVR         APB3           LL_RCC_GetAPB3Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB3_DIV_1
  *         @arg @ref LL_RCC_APB3_DIV_2
  *         @arg @ref LL_RCC_APB3_DIV_4
  *         @arg @ref LL_RCC_APB3_DIV_8
  *         @arg @ref LL_RCC_APB3_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB3Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB3DIVR, RCC_APB3DIVR_APB3DIV));
}

/**
  * @brief  Get the APB4 prescaler
  * @rmtoll APB4DIVR         APB4           LL_RCC_GetAPB4Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB4_DIV_1
  *         @arg @ref LL_RCC_APB4_DIV_2
  *         @arg @ref LL_RCC_APB4_DIV_4
  *         @arg @ref LL_RCC_APB4_DIV_8
  *         @arg @ref LL_RCC_APB4_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB4Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB4DIVR, RCC_APB4DIVR_APB4DIV));
}

/**
  * @brief  Get the APB5 prescaler
  * @rmtoll APB5DIVR         APB5           LL_RCC_GetAPB5Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB5_DIV_1
  *         @arg @ref LL_RCC_APB5_DIV_2
  *         @arg @ref LL_RCC_APB5_DIV_4
  *         @arg @ref LL_RCC_APB5_DIV_8
  *         @arg @ref LL_RCC_APB5_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB5Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB5DIVR, RCC_APB5DIVR_APB5DIV));
}

/**
  * @brief  Get the APB6 prescaler
  * @rmtoll APB6DIVR         APB6           LL_RCC_GetAPB6Prescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_APB6_DIV_1
  *         @arg @ref LL_RCC_APB6_DIV_2
  *         @arg @ref LL_RCC_APB6_DIV_4
  *         @arg @ref LL_RCC_APB6_DIV_8
  *         @arg @ref LL_RCC_APB6_DIV_16
  */
__STATIC_INLINE uint32_t LL_RCC_GetAPB6Prescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->APB6DIVR, RCC_APB6DIVR_APB6DIV));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */
/**
  * @brief  Configure peripheral clock source
  * @rmtoll MCO1CFGR           *     LL_RCC_SetClockSource\n
  *         MCO2CFGR           *     LL_RCC_SetClockSource\n
  *         CKPERCKSELR        *     LL_RCC_SetClockSource\n
  *         TIMG1PRER          *     LL_RCC_SetClockSource\n
  *         TIMG2PRER          *     LL_RCC_SetClockSource\n
  *         TIMG3PRER          *     LL_RCC_SetClockSource\n
  *         I2C12CKSELR        *     LL_RCC_SetClockSource\n
  *         I2C35CKSELR        *     LL_RCC_SetClockSource\n
  *         SPI2S1CKSELR       *     LL_RCC_SetClockSource\n
  *         SPI2S23CKSELR      *     LL_RCC_SetClockSource\n
  *         SPI45CKSELR        *     LL_RCC_SetClockSource\n
  *         USART12CKSELR      *     LL_RCC_SetClockSource\n
  *         USART35CKSELR      *     LL_RCC_SetClockSource\n
  *         UART4CKSELR        *     LL_RCC_SetClockSource\n
  *         UART6CKSELR        *     LL_RCC_SetClockSource\n
  *         UART78CKSELR       *     LL_RCC_SetClockSource\n
  *         LPTIM1CKSELR       *     LL_RCC_SetClockSource\n
  *         LPTIM23CKSELR      *     LL_RCC_SetClockSource\n
  *         LPTIM45CKSELR      *     LL_RCC_SetClockSource\n
  *         SAI1CKSELR         *     LL_RCC_SetClockSource\n
  *         SAI2CKSELR         *     LL_RCC_SetClockSource\n
  *         FDCANCKSELR        *     LL_RCC_SetClockSource\n
  *         SPDIFCKSELR        *     LL_RCC_SetClockSource\n
  *         ADC12CKSELR        *     LL_RCC_SetClockSource\n
  *         SDMMC12CKSELR      *     LL_RCC_SetClockSource\n
  *         ETH12CKSELR        *     LL_RCC_SetClockSource\n
  *         USBCKSELR          *     LL_RCC_SetClockSource\n
  *         QSPICKSELR         *     LL_RCC_SetClockSource\n
  *         FMCCKSELR          *     LL_RCC_SetClockSource\n
  *         RNG1CKSELR         *     LL_RCC_SetClockSource\n
  *         STGENCKSELR        *     LL_RCC_SetClockSource\n
  *         DCMIPPCKSELR       *     LL_RCC_SetClockSource\n
  *         SAESCKSELR         *     LL_RCC_SetClockSource\n
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO1SOURCE_HSI
  *         @arg @ref LL_RCC_MCO1SOURCE_HSE
  *         @arg @ref LL_RCC_MCO1SOURCE_CSI
  *         @arg @ref LL_RCC_MCO1SOURCE_LSI
  *         @arg @ref LL_RCC_MCO1SOURCE_LSE
  *         @arg @ref LL_RCC_MCO2SOURCE_MPU
  *         @arg @ref LL_RCC_MCO2SOURCE_AXI
  *         @arg @ref LL_RCC_MCO2SOURCE_MLAHB
  *         @arg @ref LL_RCC_MCO2SOURCE_PLL4
  *         @arg @ref LL_RCC_MCO2SOURCE_HSE
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_TIMG1PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG1PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_ACTIVATED
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_SPDIF
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE2
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PHY
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PER
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PER
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL2Q
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_LSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetClockSource(uint32_t ClkSource)
{
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)&RCC->MCO1CFGR + LL_CLKSOURCE_REG(ClkSource));
  MODIFY_REG(*pReg, LL_CLKSOURCE_MASK(ClkSource), LL_CLKSOURCE_CONFIG(ClkSource));
}

/**
  * @brief  Configure I2Cx clock source
  * @rmtoll I2C12CKSELR        I2C12SRC     LL_RCC_SetI2CClockSource\n
  *         I2C345CKSELR       I2C3SRC      LL_RCC_SetI2CClockSource
  *         I2C345CKSELR       I2C4SRC      LL_RCC_SetI2CClockSource
  *         I2C345CKSELR       I2C5SRC      LL_RCC_SetI2CClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_CSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetI2CClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure SPI/I2S clock source
  * @rmtoll SPI2S1CKSELR        SPI1SRC     LL_RCC_SetSPIClockSource\n
  *         SPI2S23CKSELR       SPI23SRC    LL_RCC_SetSPIClockSource\n
  *         SPI45CKSELR         SPI4SRC     LL_RCC_SetSPIClockSource\n
  *         SPI45CKSELR         SPI5SRC     LL_RCC_SetSPIClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPIClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

