zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/**
  * @brief  Configure U(S)ARTx clock source
  * @rmtoll UART12CKSELR       UART1SRC      LL_RCC_SetUARTClockSource\n
  *         UART12CKSELR       UART2SRC      LL_RCC_SetUARTClockSource\n
  *         UART35CKSELR       UART35SRC     LL_RCC_SetUARTClockSource\n
  *         UART4CKSELR        UART4SRC      LL_RCC_SetUARTClockSource\n
  *         UART6CKSELR        UART6SRC      LL_RCC_SetUARTClockSource\n
  *         UART78CKSELR       UART78SRC     LL_RCC_SetUARTClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUARTClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure LPTIMx clock source
  * @rmtoll LPTIM1CKSELR      LPTIM1SRC      LL_RCC_SetLPTIMClockSource\n
  *         LPTIM23CKSELR     LPTIM2SRC      LL_RCC_SetLPTIMClockSource\n
  *         LPTIM23CKSELR     LPTIM3SRC      LL_RCC_SetLPTIMClockSource\n
  *         LPTIM45CKSELR     LPTIM45SRC     LL_RCC_SetLPTIMClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PER
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPTIMClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure SAIx clock source
  * @rmtoll SAI1CKSELR        SAI1SRC     LL_RCC_SetSAIClockSource\n
  *         SAI2CKSELR        SAI2SRC     LL_RCC_SetSAIClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_SPDIF
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3R
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAIClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

#if defined(FDCAN1)
/**
  * @brief  Configure FDCAN clock source
  * @rmtoll FDCANCKSELR      FDCANSRC      LL_RCC_SetFDCANClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4R
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFDCANClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}
#endif /*FDCAN1*/

/**
  * @brief  Configure SPDIFRX clock source
  * @rmtoll SPDIFCKSELR      SPDIFSRC      LL_RCC_SetSPDIFRXClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_HSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPDIFRXClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure ADC clock source
  * @rmtoll ADC12CKSELR      ADC1SRC      LL_RCC_SetADCClockSource\n
  * @rmtoll ADC12CKSELR      ADC2SRC      LL_RCC_SetADCClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL3Q
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetADCClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure SDMMCx clock source
  * @rmtoll SDMMC12CKSELR      SDMMC1SRC       LL_RCC_SetSDMMCClockSource\n
  *         SDMMC12CKSELR      SDMMC2SRC       LL_RCC_SetSDMMCClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSDMMCClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure ETH1 clock source
  * @rmtoll ETH12CKSELR      ETH1SRC      LL_RCC_SetETHClockSource\n
  *         ETH12CKSELR      ETH2SRC      LL_RCC_SetETHClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_OFF
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetETHClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure USBPHY clock source
  * @rmtoll USBCKSELR      USBPHYSRC      LL_RCC_SetUSBPHYClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE2
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSBPHYClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure USBO clock source
  * @rmtoll USBCKSELR      USBOSRC      LL_RCC_SetUSBOClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PHY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSBOClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure QSPI clock source
  * @rmtoll QSPICKSELR      QSPISRC      LL_RCC_SetQSPIClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PER
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetQSPIClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure FMC clock source
  * @rmtoll FMCCKSELR      FMCSRC      LL_RCC_SetFMCClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PER
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetFMCClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}


/**
  * @brief  Configure RNG clock source
  * @rmtoll RNG1CKSELR      RNG1SRC      LL_RCC_SetRNGClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_LSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRNGClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure STGEN clock source
  * @rmtoll STGENCKSELR      STGENSRC      LL_RCC_SetSTGENClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_OFF
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSTGENClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure DCMIPP clock source
  * @rmtoll DCMIPPCKSELR      DCMIPPSRC      LL_RCC_SetDCMIPPClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL2Q
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PER
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDCMIPPClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure SAES clock source
  * @rmtoll SAESCKSELR      SAESSRC      LL_RCC_SetSAESClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_LSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSAESClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure CKPER clock source
  * @rmtoll CPERCKSELR      CKPERSRC      LL_RCC_SetCKPERClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_OFF
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetCKPERClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}


