zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/**
  * @brief  Get peripheral clock source
  * @rmtoll MCO1CFGR           *     LL_RCC_GetClockSource\n
  *         MCO2CFGR           *     LL_RCC_GetClockSource\n
  *         CKPERCKSELR        *     LL_RCC_GetClockSource\n
  *         TIMG1PRER          *     LL_RCC_GetClockSource\n
  *         TIMG2PRER          *     LL_RCC_GetClockSource\n
  *         TIMG3PRER          *     LL_RCC_GetClockSource\n
  *         I2C12CKSELR        *     LL_RCC_GetClockSource\n
  *         I2C35CKSELR        *     LL_RCC_GetClockSource\n
  *         SPI2S1CKSELR       *     LL_RCC_GetClockSource\n
  *         SPI2S23CKSELR      *     LL_RCC_GetClockSource\n
  *         SPI45CKSELR        *     LL_RCC_GetClockSource\n
  *         USART12CKSELR      *     LL_RCC_GetClockSource\n
  *         USART35CKSELR      *     LL_RCC_GetClockSource\n
  *         UART4CKSELR        *     LL_RCC_GetClockSource\n
  *         UART6CKSELR        *     LL_RCC_GetClockSource\n
  *         UART78CKSELR       *     LL_RCC_GetClockSource\n
  *         LPTIM1CKSELR       *     LL_RCC_GetClockSource\n
  *         LPTIM23CKSELR      *     LL_RCC_GetClockSource\n
  *         LPTIM45CKSELR      *     LL_RCC_GetClockSource\n
  *         SAI1CKSELR         *     LL_RCC_GetClockSource\n
  *         SAI2CKSELR         *     LL_RCC_GetClockSource\n
  *         FDCANCKSELR        *     LL_RCC_GetClockSource\n
  *         SPDIFCKSELR        *     LL_RCC_GetClockSource\n
  *         ADC12CKSELR        *     LL_RCC_GetClockSource\n
  *         SDMMC12CKSELR      *     LL_RCC_GetClockSource\n
  *         ETH12CKSELR        *     LL_RCC_GetClockSource\n
  *         USBCKSELR          *     LL_RCC_GetClockSource\n
  *         QSPICKSELR         *     LL_RCC_GetClockSource\n
  *         FMCCKSELR          *     LL_RCC_GetClockSource\n
  *         RNG1CKSELR         *     LL_RCC_GetClockSource\n
  *         STGENCKSELR        *     LL_RCC_GetClockSource\n
  *         DCMIPPCKSELR       *     LL_RCC_GetClockSource\n
  *         SAESCKSELR         *     LL_RCC_GetClockSource\n
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO1SOURCE_HSI
  *         @arg @ref LL_RCC_MCO2SOURCE_MLAHB
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE
  *         @arg @ref LL_RCC_TIMG1PRES
  *         @arg @ref LL_RCC_TIMG2PRES
  *         @arg @ref LL_RCC_TIMG3PRES
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE
  *         @arg @ref LL_RCC_DFSDM_CLKSOURCE
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE
  *         @arg @ref LL_RCC_USBO_CLKSOURCE
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE
  *         @arg @ref LL_RCC_FMC_CLKSOURCE
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE
  *         @arg @ref LL_RCC_SAES_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MCO1SOURCE_HSI
  *         @arg @ref LL_RCC_MCO1SOURCE_HSE
  *         @arg @ref LL_RCC_MCO1SOURCE_CSI
  *         @arg @ref LL_RCC_MCO1SOURCE_LSI
  *         @arg @ref LL_RCC_MCO1SOURCE_LSE
  *         @arg @ref LL_RCC_MCO2SOURCE_MPU
  *         @arg @ref LL_RCC_MCO2SOURCE_AXI
  *         @arg @ref LL_RCC_MCO2SOURCE_MLAHB
  *         @arg @ref LL_RCC_MCO2SOURCE_PLL4
  *         @arg @ref LL_RCC_MCO2SOURCE_HSE
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_TIMG1PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG1PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_ACTIVATED
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_SPDIF
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE2
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PHY
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PER
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PER
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL2Q
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetClockSource(uint32_t Periph)
{
  __IO const uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&RCC->MCO1CFGR) + LL_CLKSOURCE_REG(Periph)));

