zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
  return (uint32_t)(Periph | ((READ_BIT(*pReg, LL_CLKSOURCE_MASK(Periph))) << RCC_CONFIG_SHIFT));
}

/**
  * @brief  Get I2Cx clock source
  * @rmtoll I2C12CKSELR        I2C12SRC     LL_RCC_GetI2CClockSource\n
  *         I2C345CKSELR       I2C3SRC      LL_RCC_GetI2CClockSource
  *         I2C345CKSELR       I2C4SRC      LL_RCC_GetI2CClockSource
  *         I2C345CKSELR       I2C5SRC      LL_RCC_GetI2CClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C12_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C5_CLKSOURCE_CSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2CClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get SPI/I2S clock source
  * @rmtoll SPI2S1CKSELR        SPI1SRC     LL_RCC_GetSPIClockSource\n
  *         SPI2S23CKSELR       SPI23SRC    LL_RCC_GetSPIClockSource\n
  *         SPI45CKSELR         SPI4SRC     LL_RCC_GetSPIClockSource\n
  *         SPI45CKSELR         SPI5SRC     LL_RCC_GetSPIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SPI23_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get U(S)ARTx clock source
  * @rmtoll UART12CKSELR       UART1SRC      LL_RCC_GetUARTClockSource\n
  *         UART12CKSELR       UART2SRC      LL_RCC_GetUARTClockSource\n
  *         UART35CKSELR       UART35SRC     LL_RCC_GetUARTClockSource\n
  *         UART4CKSELR        UART4SRC      LL_RCC_GetUARTClockSource\n
  *         UART6CKSELR        UART6SRC      LL_RCC_GetUARTClockSource\n
  *         UART78CKSELR       UART78SRC     LL_RCC_GetUARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK6
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART35_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_UART78_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetUARTClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get LPTIMx clock source
  * @rmtoll LPTIM1CKSELR      LPTIM1SRC      LL_RCC_GetLPTIMClockSource\n
  *         LPTIM23CKSELR     LPTIM2SRC      LL_RCC_GetLPTIMClockSource\n
  *         LPTIM23CKSELR     LPTIM3SRC      LL_RCC_GetLPTIMClockSource\n
  *         LPTIM45CKSELR     LPTIM45SRC     LL_RCC_GetLPTIMClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PER
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PCLK3
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM45_CLKSOURCE_PER
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIMClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get SAIx clock source
  * @rmtoll SAI1CKSELR        SAI1SRC     LL_RCC_GetSAIClockSource\n
  *         SAI2CKSELR        SAI2SRC     LL_RCC_GetSAIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_I2SCKIN
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_SPDIF
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PLL3R
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

#if defined(FDCAN1)
/**
  * @brief  Get FDCAN clock source
  * @rmtoll FDCANCKSELR      FDCANSRC      LL_RCC_GetFDCANClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4Q
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PLL4R
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCANClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}
#endif /*FDCAN1*/

/**
  * @brief  Get SPDIFRX clock source
  * @rmtoll SPDIFCKSELR      SPDIFSRC      LL_RCC_GetSPDIFRXClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_SPDIFRX_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPDIFRXClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get ADC clock source
  * @rmtoll ADC12CKSELR      ADC1SRC      LL_RCC_GetADCClockSource\n
  * @rmtoll ADC12CKSELR      ADC2SRC      LL_RCC_GetADCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PER
  *         @arg @ref LL_RCC_ADC2_CLKSOURCE_PLL3Q
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get SDMMCx clock source
  * @rmtoll SDMMC12CKSELR      SDMMC1SRC       LL_RCC_GetSDMMCClockSource\n
  *         SDMMC12CKSELR      SDMMC2SRC       LL_RCC_GetSDMMCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HCLK6
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMCClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get ETH clock source
  * @rmtoll ETH12CKSELR      ETH1SRC      LL_RCC_GetETHClockSource\n
  *         ETH12CKSELR      ETH2SRC      LL_RCC_GetETHClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_OFF
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_PLL3Q
  *         @arg @ref LL_RCC_ETH2_CLKSOURCE_OFF
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get USBPHY clock source
  * @rmtoll USBCKSELR      USBPHYSRC      LL_RCC_GetUSBPHYClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBPHY_CLKSOURCE_HSE2
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSBPHYClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get USBO clock source
  * @rmtoll USBCKSELR      USBOSRC      LL_RCC_GetUSBOClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USBO_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_USBO_CLKSOURCE_PHY
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSBOClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get QSPI clock source
  * @rmtoll QSPICKSELR      QSPISRC      LL_RCC_GetQSPIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_QSPI_CLKSOURCE_PER
  */
__STATIC_INLINE uint32_t LL_RCC_GetQSPIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get FMC clock source
  * @rmtoll FMCCKSELR      FMCSRC      LL_RCC_GetFMCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FMC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL3R
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_PER
  */
__STATIC_INLINE uint32_t LL_RCC_GetFMCClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}


/**
  * @brief  Get RNG clock source
  * @rmtoll RNG1CKSELR      RNG1SRC      LL_RCC_GetRNGClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_RNG1_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetRNGClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get STGEN clock source
  * @rmtoll STGENCKSELR      STGENSRC      LL_RCC_GetSTGENClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_STGEN_CLKSOURCE_OFF
  */
__STATIC_INLINE uint32_t LL_RCC_GetSTGENClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get DCMIPP clock source
  * @rmtoll SAESCKSELR      DCMIPPSRC      LL_RCC_GetDCMIPPClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL2Q
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PLL4P
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PER
  */
__STATIC_INLINE uint32_t LL_RCC_GetDCMIPPClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get SAES clock source
  * @rmtoll SAESCKSELR      SAESSRC      LL_RCC_GetSAESClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAES_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_ACLK
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PER
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_PLL4R
  *         @arg @ref LL_RCC_SAES_CLKSOURCE_LSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAESClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get CKPER clock source
  * @rmtoll CPERCKSELR      CKPERSRC      LL_RCC_GetCKPERClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_CSI
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_CKPER_CLKSOURCE_OFF
  */
__STATIC_INLINE uint32_t LL_RCC_GetCKPERClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}


/**
  * @}
  */

