zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @defgroup RCC_LL_EF_TIMGx_CLOCK_PRESCALER TIMGx
  * @{
  */

/**
  * @brief  Configure TIMGx prescaler selection
  * @rmtoll TIMG1PRER      TIMG1PRE      LL_RCC_SetTIMGPrescaler\n
  *         TIMG2PRER      TIMG2PRE      LL_RCC_SetTIMGPrescaler\n
  *         TIMG3PRER      TIMG3PRE      LL_RCC_SetTIMGPrescaler
  * @param  PreSelection This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIMG1PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG1PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_ACTIVATED
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetTIMGPrescaler(uint32_t PreSelection)
{
  LL_RCC_SetClockSource(PreSelection);
}

/**
  * @brief  Get TIMGx prescaler selection
  * @rmtoll TIMG1PRER      TIMG1PRE      LL_RCC_GetTIMGPrescaler\n
  *         TIMG2PRER      TIMG2PRE      LL_RCC_GetTIMGPrescaler\n
  *         TIMG3PRER      TIMG3PRE      LL_RCC_GetTIMGPrescaler
  * @param  TIMGroup This parameter can be one of the following values:
  *         @arg @ref LL_RCC_TIMG1PRES
  *         @arg @ref LL_RCC_TIMG2PRES
  *         @arg @ref LL_RCC_TIMG3PRES
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_TIMG1PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG1PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG2PRES_ACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_DEACTIVATED
  *         @arg @ref LL_RCC_TIMG3PRES_ACTIVATED
  */
__STATIC_INLINE uint32_t LL_RCC_GetTIMGPrescaler(uint32_t TIMGroup)
{
  return LL_RCC_GetClockSource(TIMGroup);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_MCO MCO
  * @{
  */

/**
  * @brief  Configure MCOx
  * @rmtoll MCO1CFGR         MCO1SEL        LL_RCC_ConfigMCO\n
  *         MCO1CFGR         MCO1DIV        LL_RCC_ConfigMCO\n
  *         MCO2CFGR         MCO2SEL        LL_RCC_ConfigMCO\n
  *         MCO2CFGR         MCO2DIV        LL_RCC_ConfigMCO
  * @param  MCOxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO1SOURCE_HSI
  *         @arg @ref LL_RCC_MCO1SOURCE_HSE
  *         @arg @ref LL_RCC_MCO1SOURCE_CSI
  *         @arg @ref LL_RCC_MCO1SOURCE_LSI
  *         @arg @ref LL_RCC_MCO1SOURCE_LSE
  *         @arg @ref LL_RCC_MCO2SOURCE_MPU
  *         @arg @ref LL_RCC_MCO2SOURCE_AXI
  *         @arg @ref LL_RCC_MCO2SOURCE_MLAHB
  *         @arg @ref LL_RCC_MCO2SOURCE_PLL4
  *         @arg @ref LL_RCC_MCO2SOURCE_HSE
  *         @arg @ref LL_RCC_MCO2SOURCE_HSI
  * @param  MCOxPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO1_DIV_1
  *         @arg @ref LL_RCC_MCO1_DIV_2
  *         @arg @ref LL_RCC_MCO1_DIV_3
  *         @arg @ref LL_RCC_MCO1_DIV_4
  *         @arg @ref LL_RCC_MCO1_DIV_5
  *         @arg @ref LL_RCC_MCO1_DIV_6
  *         @arg @ref LL_RCC_MCO1_DIV_7
  *         @arg @ref LL_RCC_MCO1_DIV_8
  *         @arg @ref LL_RCC_MCO1_DIV_9
  *         @arg @ref LL_RCC_MCO1_DIV_10
  *         @arg @ref LL_RCC_MCO1_DIV_11
  *         @arg @ref LL_RCC_MCO1_DIV_12
  *         @arg @ref LL_RCC_MCO1_DIV_13
  *         @arg @ref LL_RCC_MCO1_DIV_14
  *         @arg @ref LL_RCC_MCO1_DIV_15
  *         @arg @ref LL_RCC_MCO1_DIV_16
  *         @arg @ref LL_RCC_MCO2_DIV_1
  *         @arg @ref LL_RCC_MCO2_DIV_2
  *         @arg @ref LL_RCC_MCO2_DIV_3
  *         @arg @ref LL_RCC_MCO2_DIV_4
  *         @arg @ref LL_RCC_MCO2_DIV_5
  *         @arg @ref LL_RCC_MCO2_DIV_6
  *         @arg @ref LL_RCC_MCO2_DIV_7
  *         @arg @ref LL_RCC_MCO2_DIV_8
  *         @arg @ref LL_RCC_MCO2_DIV_9
  *         @arg @ref LL_RCC_MCO2_DIV_10
  *         @arg @ref LL_RCC_MCO2_DIV_11
  *         @arg @ref LL_RCC_MCO2_DIV_12
  *         @arg @ref LL_RCC_MCO2_DIV_13
  *         @arg @ref LL_RCC_MCO2_DIV_14
  *         @arg @ref LL_RCC_MCO2_DIV_15
  *         @arg @ref LL_RCC_MCO2_DIV_16
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ConfigMCO(uint32_t MCOxSource, uint32_t MCOxPrescaler)
{
  LL_RCC_SetClockSource(MCOxSource);

  /* Set MCOx prescaler */
  __IO uint32_t *pReg = (__IO uint32_t *)((uint32_t)&RCC->MCO1CFGR + LL_CLKSOURCE_REG(MCOxSource));
  /* RCC_MCO1CFGR_MCO1DIV and RCC_MCO2CFGR_MCO2DIV are the same value */
  MODIFY_REG(*pReg, RCC_MCO1CFGR_MCO1DIV, MCOxPrescaler);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Set the oscillator used as PLL1 and PLL2 clock source.
  * @note   PLLSRC can be written only when all PLL1 and PLL2 are disabled.
  * @rmtoll RCK12SELR      PLL12SRC        LL_RCC_PLL12_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL12SOURCE_HSI
  *         @arg @ref LL_RCC_PLL12SOURCE_HSE
  *         @arg @ref LL_RCC_PLL12SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL12_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->RCK12SELR, RCC_RCK12SELR_PLL12SRC, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL1 and PLL2 clock source.
  * @rmtoll RCK12SELR      PLL12SRC        LL_RCC_PLL12_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL12SOURCE_HSI
  *         @arg @ref LL_RCC_PLL12SOURCE_HSE
  *         @arg @ref LL_RCC_PLL12SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL12_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->RCK12SELR, RCC_RCK12SELR_PLL12SRC));
}

/**
  * @brief  Enable PLL1
  * @rmtoll PLL1CR           PLLON         LL_RCC_PLL1_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1_Enable(void)
{
  SET_BIT(RCC->PLL1CR, RCC_PLL1CR_PLLON);
}

/**
  * @brief  Disable PLL1
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL1 DIVPEN, DIVQEN and
  *       DIVREN are disabled.
  * @rmtoll PLL1CR           PLLON         LL_RCC_PLL1_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1_Disable(void)
{
  CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_PLLON);
}

/**
  * @brief  Check if PLL1 Ready
  * @rmtoll PLL1CR           PLL1RDY        LL_RCC_PLL1_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1_IsReady(void)
{
  return ((READ_BIT(RCC->PLL1CR, RCC_PLL1CR_PLL1RDY) == RCC_PLL1CR_PLL1RDY) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL1P
  * @note   This API shall be called only when PLL1 is enabled and ready.
  * @rmtoll PLL1CR           DIVPEN         LL_RCC_PLL1P_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1P_Enable(void)
{
  SET_BIT(RCC->PLL1CR, RCC_PLL1CR_DIVPEN);
}

/**
  * @brief  Enable PLL1 FRACV
  * @rmtoll PLL1FRACR           FRACLE         LL_RCC_PLL1FRACV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1FRACV_Enable(void)
{
  SET_BIT(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACLE);
}

/**
  * @brief  Enable PLL1 Clock Spreading Generator
  * @rmtoll PLL1CR           SSCG_CTRL         LL_RCC_PLL1CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1CSG_Enable(void)
{
  SET_BIT(RCC->PLL1CR, RCC_PLL1CR_SSCG_CTRL);
}

/**
  * @brief  Check if PLL1 P is enabled
  * @rmtoll PLL1CR           DIVPEN         LL_RCC_PLL1P_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1P_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL1CR, RCC_PLL1CR_DIVPEN) == RCC_PLL1CR_DIVPEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL1 FRACV is enabled
  * @rmtoll PLL1FRACR           FRACLE         LL_RCC_PLL1FRACV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1FRACV_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACLE) == RCC_PLL1FRACR_FRACLE) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL1 Clock Spreading Generator is enabled
  * @rmtoll PLL1CR           SSCG_CTRL         LL_RCC_PLL1CSG_IsEnabled
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1CSG_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL1CR, RCC_PLL1CR_SSCG_CTRL) == RCC_PLL1CR_SSCG_CTRL) ? 1UL : 0UL);
}

/**
  * @brief  Disable PLL1P
  * @rmtoll PLL1CR           DIVPEN         LL_RCC_PLL1P_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1P_Disable(void)
{
  CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_DIVPEN);
}

/**
  * @brief  Disable PLL1 FRACV
  * @rmtoll PLL1FRACR           FRACLE         LL_RCC_PLL1FRACV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1FRACV_Disable(void)
{
  CLEAR_BIT(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACLE);
}

/**
  * @brief  Disable PLL1 Clock Spreading Generator
  * @rmtoll PLL1CR           SSCG_CTRL         LL_RCC_PLL1CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1CSG_Disable(void)
{
  CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_SSCG_CTRL);
}

/**
  * @brief  Get PLL1 N Coefficient
  * @rmtoll PLL1CFGR1        DIVN          LL_RCC_PLL1_GetN
  * @retval A value between 4 and 512
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1_GetN(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL1CFGR1, RCC_PLL1CFGR1_DIVN) >>  RCC_PLL1CFGR1_DIVN_Pos) + 1U);
}

/**
  * @brief  Get PLL1 M Coefficient
  * @rmtoll PLL1CFGR1       DIVM1          LL_RCC_PLL1_GetM
  * @retval A value between 1 and 64
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1_GetM(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL1CFGR1, RCC_PLL1CFGR1_DIVM1) >>  RCC_PLL1CFGR1_DIVM1_Pos) + 1U);
}

/**
  * @brief  Get PLL1 P Coefficient
  * @rmtoll PLL1CFGR2        DIVP          LL_RCC_PLL1_GetP
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1_GetP(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL1CFGR2, RCC_PLL1CFGR2_DIVP) >>  RCC_PLL1CFGR2_DIVP_Pos) + 1U);
}

/**
  * @brief  Get PLL1 FRACV Coefficient
  * @rmtoll PLL1FRACR      FRACV          LL_RCC_PLL1_GetFRACV
  * @retval A value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL1_GetFRACV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACV) >>  RCC_PLL1FRACR_FRACV_Pos);
}

/**
  * @brief  Set PLL1 N Coefficient
  * @note   This API shall be called only when PLL1 is disabled.
  * @rmtoll PLL1CFGR1        DIVN          LL_RCC_PLL1_SetN
  * @param  DIVN parameter can be a value between 4 and 512
  */
__STATIC_INLINE void LL_RCC_PLL1_SetN(uint32_t DIVN)
{
  MODIFY_REG(RCC->PLL1CFGR1, RCC_PLL1CFGR1_DIVN, (DIVN - 1U) << RCC_PLL1CFGR1_DIVN_Pos);
}

/**
  * @brief  Set PLL1 M Coefficient
  * @note   This API shall be called only when PLL1 is disabled.
  * @rmtoll PLL1CFGR1       DIVM1          LL_RCC_PLL1_SetM
  * @param  DIVM1 parameter can be a value between 1 and 64
  */
__STATIC_INLINE void LL_RCC_PLL1_SetM(uint32_t DIVM1)
{
  MODIFY_REG(RCC->PLL1CFGR1, RCC_PLL1CFGR1_DIVM1, (DIVM1 - 1U) << RCC_PLL1CFGR1_DIVM1_Pos);
}

/**
  * @brief  Set PLL1 P Coefficient
  * @rmtoll PLL1CFGR2        DIVP          LL_RCC_PLL1_SetP
  * @param  DIVP parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL1_SetP(uint32_t DIVP)
{
  MODIFY_REG(RCC->PLL1CFGR2, RCC_PLL1CFGR2_DIVP, (DIVP - 1U) << RCC_PLL1CFGR2_DIVP_Pos);
}

/**
  * @brief  Set PLL1 FRACV Coefficient
  * @rmtoll PLL1FRACR        FRACV          LL_RCC_PLL1_SetFRACV
  * @param  FRACV parameter can be a value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE void LL_RCC_PLL1_SetFRACV(uint32_t FRACV)
{
  MODIFY_REG(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACV, FRACV << RCC_PLL1FRACR_FRACV_Pos);
}

