zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_rcc.h
/** @brief  Configure the PLL1 Clock Spreading Generator
  * @rmtoll PLL1CSGR    MOD_PER, TPDFN_DIS, RPDFN_DIS, SSCG_MODE, INC_STEP  LL_RCC_PLL1_ConfigCSG
  *
  * @param  ModPeriod: Modulation Period Adjustment for PLL1
  *         This parameter must have a value between 1 and 8191
  *
  * @param  TPDFN
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL1TPDFN_DIS_ENABLED
  *         @arg @ref LL_RCC_PLL1TPDFN_DIS_DISABLED

  * @param  RPDFN
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL1RPDFN_DIS_ENABLED
  *         @arg @ref LL_RCC_PLL1RPDFN_DIS_DISABLED
  *
  * @param  SSCGMode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL1SSCG_CENTER_SPREAD
  *         @arg @ref LL_RCC_PLL1SSCG_DOWN_SPREAD
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL1
  *         This parameter must have a value between 1 and 32767
  * @note   ModPeriod x IncStep shall not exceed (2^15)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL1_ConfigCSG(uint32_t ModPeriod, uint32_t TPDFN, uint32_t RPDFN, uint32_t SSCGMode,
                                           uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL1CSGR, (RCC_PLL1CSGR_MOD_PER | RCC_PLL1CSGR_TPDFN_DIS | RCC_PLL1CSGR_RPDFN_DIS | \
                             RCC_PLL1CSGR_SSCG_MODE | RCC_PLL1CSGR_INC_STEP), \
             (ModPeriod | TPDFN | RPDFN | SSCGMode | (IncStep << RCC_PLL1CSGR_INC_STEP_Pos)));
}

/**
  * @brief  Enable PLL2
  * @rmtoll PLL2CR           PLLON         LL_RCC_PLL2_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_Enable(void)
{
  SET_BIT(RCC->PLL2CR, RCC_PLL2CR_PLLON);
}

/**
  * @brief  Disable PLL2
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL1 DIVPEN, DIVQEN and DIVREN
  *       are disabled.
  * @rmtoll PLL2CR           PLLON         LL_RCC_PLL2_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_PLLON);
}

/**
  * @brief  Check if PLL2 Ready
  * @rmtoll PLL2CR           PLL2RDY        LL_RCC_PLL2_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_IsReady(void)
{
  return ((READ_BIT(RCC->PLL2CR, RCC_PLL2CR_PLL2RDY) == RCC_PLL2CR_PLL2RDY) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL2P
  * @note   This API shall be called only when PLL2 is enabled and ready.
  * @rmtoll PLL2CR           DIVPEN         LL_RCC_PLL2P_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2P_Enable(void)
{
  SET_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVPEN);
}

/**
  * @brief  Enable PLL2Q
  * @note   This API shall be called only when PLL2 is enabled and ready.
  * @rmtoll PLL2CR           DIVQEN         LL_RCC_PLL2Q_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2Q_Enable(void)
{
  SET_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVQEN);
}

/**
  * @brief  Enable PLL2R
  * @note   This API shall be called only when PLL2 is enabled and ready.
  * @rmtoll PLL2CR           DIVREN         LL_RCC_PLL2R_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2R_Enable(void)
{
  SET_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVREN);
}

/**
  * @brief  Enable PLL2 FRACV
  * @rmtoll PLL2FRACR           FRACLE         LL_RCC_PLL2FRACV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2FRACV_Enable(void)
{
  SET_BIT(RCC->PLL2FRACR, RCC_PLL2FRACR_FRACLE);
}

/**
  * @brief  Enable PLL2 Clock Spreading Generator
  * @rmtoll PLL2CR           SSCG_CTRL         LL_RCC_PLL2CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2CSG_Enable(void)
{
  SET_BIT(RCC->PLL2CR, RCC_PLL2CR_SSCG_CTRL);
}

/**
  * @brief  Check if PLL2 P is enabled
  * @rmtoll PLL2CR           DIVPEN         LL_RCC_PLL2P_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2P_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVPEN) == RCC_PLL2CR_DIVPEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL2 Q is enabled
  * @rmtoll PLL2CR           DIVQEN         LL_RCC_PLL2Q_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2Q_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVQEN) == RCC_PLL2CR_DIVQEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL2 R is enabled
  * @rmtoll PLL2CR           DIVREN         LL_RCC_PLL2R_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2R_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVREN) == RCC_PLL2CR_DIVREN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL2 FRACV is enabled
  * @rmtoll PLL2FRACR           FRACLE         LL_RCC_PLL2FRACV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2FRACV_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2FRACR, RCC_PLL2FRACR_FRACLE) == RCC_PLL2FRACR_FRACLE) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL2 Clock Spreading Generator is enabled
  * @rmtoll PLL2CR           SSCG_CTRL         LL_RCC_PLL2CSG_IsEnabled
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2CSG_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CR, RCC_PLL2CR_SSCG_CTRL) == RCC_PLL2CR_SSCG_CTRL) ? 1UL : 0UL);
}

/**
  * @brief  Disable PLL2P
  * @rmtoll PLL2CR           DIVPEN         LL_RCC_PLL2P_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2P_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVPEN);
}

/**
  * @brief  Disable PLL2Q
  * @rmtoll PLL2CR           DIVQEN         LL_RCC_PLL2Q_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2Q_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVQEN);
}

/**
  * @brief  Disable PLL2R
  * @rmtoll PLL2CR           DIVREN         LL_RCC_PLL2R_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2R_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_DIVREN);
}

/**
  * @brief  Disable PLL2 FRACV
  * @rmtoll PLL2FRACR           FRACLE         LL_RCC_PLL2FRACV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2FRACV_Disable(void)
{
  CLEAR_BIT(RCC->PLL2FRACR, RCC_PLL2FRACR_FRACLE);
}

/**
  * @brief  Disable PLL2 Clock Spreading Generator
  * @rmtoll PLL2CR           SSCG_CTRL         LL_RCC_PLL2CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2CSG_Disable(void)
{
  CLEAR_BIT(RCC->PLL2CR, RCC_PLL2CR_SSCG_CTRL);
}

/**
  * @brief  Get PLL2 N Coefficient
  * @rmtoll PLL2CFGR1        DIVN          LL_RCC_PLL2_GetN
  * @retval A value between 4 and 512
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetN(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_DIVN) >>  RCC_PLL2CFGR1_DIVN_Pos) + 1U);
}

/**
  * @brief  Get PLL2 M Coefficient
  * @rmtoll PLL2CFGR1       DIVM2          LL_RCC_PLL2_GetM
  * @retval A value between 1 and 64
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetM(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CFGR1, RCC_PLL2CFGR1_DIVM2) >>  RCC_PLL2CFGR1_DIVM2_Pos) + 1U);
}

/**
  * @brief  Get PLL2 P Coefficient
  * @rmtoll PLL2CFGR2        DIVP          LL_RCC_PLL2_GetP
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetP(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CFGR2, RCC_PLL2CFGR2_DIVP) >>  RCC_PLL2CFGR2_DIVP_Pos) + 1U);
}

/**
  * @brief  Get PLL2 Q Coefficient
  * @rmtoll PLL2CFGR2        DIVQ          LL_RCC_PLL2_GetQ
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetQ(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CFGR2, RCC_PLL2CFGR2_DIVQ) >>  RCC_PLL2CFGR2_DIVQ_Pos) + 1U);
}

/**
  * @brief  Get PLL2 R Coefficient
  * @rmtoll PLL2CFGR2        DIVR          LL_RCC_PLL2_GetR
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetR(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL2CFGR2, RCC_PLL2CFGR2_DIVR) >>  RCC_PLL2CFGR2_DIVR_Pos) + 1U);
}

/**
  * @brief  Get PLL2 FRACV Coefficient
  * @rmtoll PLL2FRACR      FRACV          LL_RCC_PLL2_GetFRACV
  * @retval A value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL2_GetFRACV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL2FRACR, RCC_PLL2FRACR_FRACV) >>  RCC_PLL2FRACR_FRACV_Pos);
}

/**
  * @brief  Set PLL2 N Coefficient
  * @note   This API shall be called only when PLL2 is disabled.
  * @rmtoll PLL2CFGR1        DIVN          LL_RCC_PLL2_SetN
  * @param  DIVN parameter can be a value between 4 and 512
  */
__STATIC_INLINE void LL_RCC_PLL2_SetN(uint32_t DIVN)
{
  MODIFY_REG(RCC->PLL2CFGR1, RCC_PLL2CFGR1_DIVN, (DIVN - 1U) << RCC_PLL2CFGR1_DIVN_Pos);
}

/**
  * @brief  Set PLL2 M Coefficient
  * @note   This API shall be called only when PLL2 is disabled.
  * @rmtoll PLL2CFGR1       DIVM2          LL_RCC_PLL2_SetM
  * @param  DIVM2 parameter can be a value between 1 and 64
  */
__STATIC_INLINE void LL_RCC_PLL2_SetM(uint32_t DIVM2)
{
  MODIFY_REG(RCC->PLL2CFGR1, RCC_PLL2CFGR1_DIVM2, (DIVM2 - 1U) << RCC_PLL2CFGR1_DIVM2_Pos);
}

/**
  * @brief  Set PLL2 P Coefficient
  * @rmtoll PLL2CFGR2        DIVP          LL_RCC_PLL2_SetP
  * @param  DIVP parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL2_SetP(uint32_t DIVP)
{
  MODIFY_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_DIVP, (DIVP - 1U) << RCC_PLL2CFGR2_DIVP_Pos);
}

/**
  * @brief  Set PLL2 Q Coefficient
  * @rmtoll PLL2CFGR2        DIVQ          LL_RCC_PLL2_SetQ
  * @param  DIVQ parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL2_SetQ(uint32_t DIVQ)
{
  MODIFY_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_DIVQ, (DIVQ - 1U) << RCC_PLL2CFGR2_DIVQ_Pos);
}

/**
  * @brief  Set PLL2 R Coefficient
  * @rmtoll PLL2CFGR2        DIVR          LL_RCC_PLL2_SetR
  * @param  DIVR parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL2_SetR(uint32_t DIVR)
{
  MODIFY_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_DIVR, (DIVR - 1U) << RCC_PLL2CFGR2_DIVR_Pos);
}

/**
  * @brief  Set PLL2 FRACV Coefficient
  * @rmtoll PLL2FRACR        FRACV          LL_RCC_PLL2_SetFRACV
  * @param  FRACV parameter can be a value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE void LL_RCC_PLL2_SetFRACV(uint32_t FRACV)
{
  MODIFY_REG(RCC->PLL2FRACR, RCC_PLL2FRACR_FRACV, FRACV << RCC_PLL2FRACR_FRACV_Pos);
}

/** @brief  Configure the PLL2 Clock Spreading Generator
  * @rmtoll PLL2CSGR    MOD_PER, TPDFN_DIS, RPDFN_DIS, SSCG_MODE, INC_STEP  LL_RCC_PLL2_ConfigCSG
  *
  * @param  ModPeriod: Modulation Period Adjustment for PLL2
  *         This parameter must have a value between 1 and 8191
  *
  * @param  TPDFN
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL2TPDFN_DIS_ENABLED
  *         @arg @ref LL_RCC_PLL2TPDFN_DIS_DISABLED

  * @param  RPDFN
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL2RPDFN_DIS_ENABLED
  *         @arg @ref LL_RCC_PLL2RPDFN_DIS_DISABLED
  *
  * @param  SSCGMode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL2SSCG_CENTER_SPREAD
  *         @arg @ref LL_RCC_PLL2SSCG_DOWN_SPREAD
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL2
  *         This parameter must have a value between 1 and 32767
  * @note   ModPeriod x IncStep shall not exceed (2^15)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL2_ConfigCSG(uint32_t ModPeriod, uint32_t TPDFN, uint32_t RPDFN, uint32_t SSCGMode,
                                           uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL2CSGR, (RCC_PLL2CSGR_MOD_PER | RCC_PLL2CSGR_TPDFN_DIS | RCC_PLL2CSGR_RPDFN_DIS | \
                             RCC_PLL2CSGR_SSCG_MODE | RCC_PLL2CSGR_INC_STEP), \
             (ModPeriod | TPDFN | RPDFN | SSCGMode | (IncStep << RCC_PLL2CSGR_INC_STEP_Pos)));
}

/**
  * @brief  Set the oscillator used as PLL3 clock source.
  * @note   PLLSRC can be written only when all PLL3 is disabled.
  * @rmtoll RCK3SELR      PLL3SRC        LL_RCC_PLL3_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL3SOURCE_HSI
  *         @arg @ref LL_RCC_PLL3SOURCE_HSE
  *         @arg @ref LL_RCC_PLL3SOURCE_CSI
  *         @arg @ref LL_RCC_PLL3SOURCE_NONE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->RCK3SELR, RCC_RCK3SELR_PLL3SRC, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL3 clock source.
  * @rmtoll RCK3SELR      PLL3SRC        LL_RCC_PLL3_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL3SOURCE_HSI
  *         @arg @ref LL_RCC_PLL3SOURCE_HSE
  *         @arg @ref LL_RCC_PLL3SOURCE_CSI
  *         @arg @ref LL_RCC_PLL3SOURCE_NONE
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->RCK3SELR, RCC_RCK3SELR_PLL3SRC));
}

/**
  * @brief  Enable PLL3
  * @rmtoll PLL3CR           PLLON         LL_RCC_PLL3_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_Enable(void)
{
  SET_BIT(RCC->PLL3CR, RCC_PLL3CR_PLLON);
}

/**
  * @brief  Disable PLL3
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL1 DIVPEN, DIVQEN and DIVREN are
  *       disabled.
  * @rmtoll PLL3CR           PLLON         LL_RCC_PLL3_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_PLLON);
}

/**
  * @brief  Check if PLL3 Ready
  * @rmtoll PLL3CR           PLL3RDY        LL_RCC_PLL3_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsReady(void)
{
  return ((READ_BIT(RCC->PLL3CR, RCC_PLL3CR_PLL3RDY) == RCC_PLL3CR_PLL3RDY) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL3P
  * @note   This API shall be called only when PLL3 is enabled and ready.
  * @rmtoll PLL3CR           DIVPEN         LL_RCC_PLL3P_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3P_Enable(void)
{
  SET_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVPEN);
}

/**
  * @brief  Enable PLL3Q
  * @note   This API shall be called only when PLL3 is enabled and ready.
  * @rmtoll PLL3CR           DIVQEN         LL_RCC_PLL3Q_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3Q_Enable(void)
{
  SET_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVQEN);
}

/**
  * @brief  Enable PLL3R
  * @note   This API shall be called only when PLL3 is enabled and ready.
  * @rmtoll PLL3CR           DIVREN         LL_RCC_PLL3R_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3R_Enable(void)
{
  SET_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVREN);
}

/**
  * @brief  Enable PLL3 FRACV
  * @rmtoll PLL3FRACR           FRACLE         LL_RCC_PLL3FRACV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3FRACV_Enable(void)
{
  SET_BIT(RCC->PLL3FRACR, RCC_PLL3FRACR_FRACLE);
}

/**
  * @brief  Enable PLL3 Clock Spreading Generator
  * @rmtoll PLL3CR           SSCG_CTRL         LL_RCC_PLL3CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3CSG_Enable(void)
{
  SET_BIT(RCC->PLL3CR, RCC_PLL3CR_SSCG_CTRL);
}

/**
  * @brief  Check if PLL3 P is enabled
  * @rmtoll PLL3CR           DIVPEN         LL_RCC_PLL3P_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3P_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVPEN) == RCC_PLL3CR_DIVPEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL3 Q is enabled
  * @rmtoll PLL3CR           DIVQEN         LL_RCC_PLL3Q_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3Q_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVQEN) == RCC_PLL3CR_DIVQEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL3 R is enabled
  * @rmtoll PLL3CR           DIVREN         LL_RCC_PLL3R_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3R_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVREN) == RCC_PLL3CR_DIVREN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL3 FRACV is enabled
  * @rmtoll PLL3FRACR           FRACLE         LL_RCC_PLL3FRACV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3FRACV_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3FRACR, RCC_PLL3FRACR_FRACLE) == RCC_PLL3FRACR_FRACLE) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL3 Clock Spreading Generator is enabled
  * @rmtoll PLL3CR           SSCG_CTRL         LL_RCC_PLL3CSG_IsEnabled
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3CSG_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CR, RCC_PLL3CR_SSCG_CTRL) == RCC_PLL3CR_SSCG_CTRL) ? 1UL : 0UL);
}

/**
  * @brief  Disable PLL3P
  * @rmtoll PLL3CR           DIVPEN         LL_RCC_PLL3P_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3P_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVPEN);
}

/**
  * @brief  Disable PLL3Q
  * @rmtoll PLL3CR           DIVQEN         LL_RCC_PLL3Q_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3Q_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVQEN);
}

/**
  * @brief  Disable PLL3R
  * @rmtoll PLL3CR           DIVREN         LL_RCC_PLL3R_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3R_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_DIVREN);
}

/**
  * @brief  Disable PLL3 FRACV
  * @rmtoll PLL3FRACR           FRACLE         LL_RCC_PLL3FRACV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3FRACV_Disable(void)
{
  CLEAR_BIT(RCC->PLL3FRACR, RCC_PLL3FRACR_FRACLE);
}

/**
  * @brief  Disable PLL3 Clock Spreading Generator
  * @rmtoll PLL3CR           SSCG_CTRL         LL_RCC_PLL3CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3CSG_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_SSCG_CTRL);
}

/**
  * @brief  Get PLL3 N Coefficient
  * @rmtoll PLL3CFGR1        DIVN          LL_RCC_PLL3_GetN
  * @retval A value between 4 and 512
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetN(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_DIVN) >>  RCC_PLL3CFGR1_DIVN_Pos) + 1U);
}

/**
  * @brief  Get PLL3 M Coefficient
  * @rmtoll PLL3CFGR1       DIVM3          LL_RCC_PLL3_GetM
  * @retval A value between 1 and 64
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetM(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_DIVM3) >>  RCC_PLL3CFGR1_DIVM3_Pos) + 1U);
}

/**
  * @brief  Get PLL3 input frequency range
  * @rmtoll PLL3CFGR1       IFRGE          LL_RCC_PLL3_GetIFRGE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL3IFRANGE_0
  *         @arg @ref LL_RCC_PLL3IFRANGE_1
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetIFRGE(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_IFRGE));
}

/**
  * @brief  Get PLL3 P Coefficient
  * @rmtoll PLL3CFGR2        DIVP          LL_RCC_PLL3_GetP
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetP(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_DIVP) >>  RCC_PLL3CFGR2_DIVP_Pos) + 1U);
}

/**
  * @brief  Get PLL3 Q Coefficient
  * @rmtoll PLL3CFGR2        DIVQ          LL_RCC_PLL3_GetQ
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetQ(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_DIVQ) >>  RCC_PLL3CFGR2_DIVQ_Pos) + 1U);
}

/**
  * @brief  Get PLL3 R Coefficient
  * @rmtoll PLL3CFGR2        DIVR          LL_RCC_PLL3_GetR
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetR(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_DIVR) >>  RCC_PLL3CFGR2_DIVR_Pos) + 1U);
}

/**
  * @brief  Get PLL3 FRACV Coefficient
  * @rmtoll PLL3FRACR      FRACV          LL_RCC_PLL3_GetFRACV
  * @retval A value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFRACV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3FRACR, RCC_PLL3FRACR_FRACV) >>  RCC_PLL3FRACR_FRACV_Pos);
}

/**
  * @brief  Set PLL3 N Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR1        DIVN          LL_RCC_PLL3_SetN
  * @param  DIVN parameter can be a value between 4 and 512
  */
__STATIC_INLINE void LL_RCC_PLL3_SetN(uint32_t DIVN)
{
  MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_DIVN, (DIVN - 1U) << RCC_PLL3CFGR1_DIVN_Pos);
}

/**
  * @brief  Set PLL3 M Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR1       DIVM3          LL_RCC_PLL3_SetM
  * @param  DIVM3 parameter can be a value between 1 and 64
  */
__STATIC_INLINE void LL_RCC_PLL3_SetM(uint32_t DIVM3)
{
  MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_DIVM3, (DIVM3 - 1U) << RCC_PLL3CFGR1_DIVM3_Pos);
}

/**
  * @brief  Set PLL3 input frequency range
  * @rmtoll PLL3CFGR1       IFRGE          LL_RCC_PLL3_SetIFRGE
  * @param  IFRange parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL3IFRANGE_0
  *         @arg @ref LL_RCC_PLL3IFRANGE_1
  * @note   If ref3_ck is equal to 8 MHz, it is recommended to set LL_RCC_PLL3IFRANGE_1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_SetIFRGE(uint32_t IFRange)
{
  MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_IFRGE, IFRange);
}

/**
  * @brief  Set PLL3 P Coefficient
  * @rmtoll PLL3CFGR2        DIVP          LL_RCC_PLL3_SetP
  * @param  DIVP parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL3_SetP(uint32_t DIVP)
{
  MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_DIVP, (DIVP - 1U) << RCC_PLL3CFGR2_DIVP_Pos);
}

/**
  * @brief  Set PLL3 Q Coefficient
  * @rmtoll PLL3CFGR2        DIVQ          LL_RCC_PLL3_SetQ
  * @param  DIVQ parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL3_SetQ(uint32_t DIVQ)
{
  MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_DIVQ, (DIVQ - 1U) << RCC_PLL3CFGR2_DIVQ_Pos);
}

/**
  * @brief  Set PLL3 R Coefficient
  * @rmtoll PLL3CFGR2        DIVR          LL_RCC_PLL3_SetR
  * @param  DIVR parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL3_SetR(uint32_t DIVR)
{
  MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_DIVR, (DIVR - 1U) << RCC_PLL3CFGR2_DIVR_Pos);
}

/**
  * @brief  Set PLL3 FRACV Coefficient
  * @rmtoll PLL3FRACR        FRACV          LL_RCC_PLL3_SetFRACV
  * @param  FRACV parameter can be a value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE void LL_RCC_PLL3_SetFRACV(uint32_t FRACV)
{
  MODIFY_REG(RCC->PLL3FRACR, RCC_PLL3FRACR_FRACV, FRACV << RCC_PLL3FRACR_FRACV_Pos);
}

/** @brief  Configure the PLL3 Clock Spreading Generator
  * @rmtoll PLL3CSGR    MOD_PER, TPDFN_DIS, RPDFN_DIS, SSCG_MODE, INC_STEP  LL_RCC_PLL3_ConfigCSG
  *
  * @param  ModPeriod: Modulation Period Adjustment for PLL3
  *         This parameter must have a value between 1 and 8191
  *
  * @param  TPDFN
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL3TPDFN_DIS_ENABLED
  *         @arg @ref LL_RCC_PLL3TPDFN_DIS_DISABLED

  * @param  RPDFN
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL3RPDFN_DIS_ENABLED
  *         @arg @ref LL_RCC_PLL3RPDFN_DIS_DISABLED
  *
  * @param  SSCGMode
  *         This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL3SSCG_CENTER_SPREAD
  *         @arg @ref LL_RCC_PLL3SSCG_DOWN_SPREAD
  *
  * @param  IncStep: Modulation Depth Adjustment for PLL3
  *         This parameter must have a value between 1 and 32767
  * @note   ModPeriod x IncStep shall not exceed (2^15)-1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_ConfigCSG(uint32_t ModPeriod, uint32_t TPDFN, uint32_t RPDFN, uint32_t SSCGMode,
                                           uint32_t IncStep)
{
  MODIFY_REG(RCC->PLL3CSGR, (RCC_PLL3CSGR_MOD_PER | RCC_PLL3CSGR_TPDFN_DIS | RCC_PLL3CSGR_RPDFN_DIS | \
                             RCC_PLL3CSGR_SSCG_MODE | RCC_PLL3CSGR_INC_STEP), \
             (ModPeriod | TPDFN | RPDFN | SSCGMode | (IncStep << RCC_PLL3CSGR_INC_STEP_Pos)));
}

